[
    {
        "title": "CAR Conference registration (Wednesday)",
        "type": "Special Event",
        "description": "CAR Conference registration will be located in Salon EF on the lobby level of the Newport Beach Marriott.",
        "speakers": null,
        "date": "2019-03-06",
        "time_start": "15:00",
        "time_end": "18:00",
        "length_in_hours": 3.0,
        "room": "Salon EF",
        "event_id": "3433/4377",
        "event_url": "https://ire.org/events-and-training/event/3433/4377/"
    },
    {
        "title": "CAR Conference sales (Wednesday)",
        "type": "Special Event",
        "description": "Stop by the CAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the T-shirt contest.",
        "speakers": null,
        "date": "2019-03-06",
        "time_start": "15:00",
        "time_end": "18:00",
        "length_in_hours": 3.0,
        "room": "Salon EF",
        "event_id": "3433/4378",
        "event_url": "https://ire.org/events-and-training/event/3433/4378/"
    },
    {
        "title": "International meet & greet **invitation-only event",
        "type": "Special Event",
        "description": null,
        "speakers": null,
        "date": "2019-03-07",
        "time_start": "07:30",
        "time_end": "08:15",
        "length_in_hours": 0.75,
        "room": "Baycliff",
        "event_id": "3433/4371",
        "event_url": "https://ire.org/events-and-training/event/3433/4371/"
    },
    {
        "title": "CAR Conference registration (Thursday)",
        "type": "Special Event",
        "description": "CAR Conference registration will be located in Salon EF on the lobby level of the Newport Beach Marriott.",
        "speakers": null,
        "date": "2019-03-07",
        "time_start": "07:30",
        "time_end": "18:00",
        "length_in_hours": 10.5,
        "room": "Salon EF",
        "event_id": "3433/4379",
        "event_url": "https://ire.org/events-and-training/event/3433/4379/"
    },
    {
        "title": "CAR Conference sales (Thursday)",
        "type": "Special Event",
        "description": "Stop by the CAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the T-shirt contest.",
        "speakers": null,
        "date": "2019-03-07",
        "time_start": "07:30",
        "time_end": "18:00",
        "length_in_hours": 10.5,
        "room": "Salon EF",
        "event_id": "3433/4380",
        "event_url": "https://ire.org/events-and-training/event/3433/4380/"
    },
    {
        "title": "Welcome first-timers",
        "type": "Panel",
        "description": "Welcome to the conference! Hear from IRE staff about tips and tactics to navigate our conference like a pro. Also, you'll learn about key resources that IRE offers once you're back home.",
        "speakers": "Doug Haddix of IRE and NICAR; Denise Malan of IRE and NICAR",
        "date": "2019-03-07",
        "time_start": "08:30",
        "time_end": "08:50",
        "length_in_hours": 0.333,
        "room": "Salon C",
        "event_id": "3433/4349",
        "event_url": "https://ire.org/events-and-training/event/3433/4349/"
    },
    {
        "title": "An introduction to data visualization with Tableau (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Beginner.\n\nParticipants will get an introduction to Tableau and the Tableau Public platform. In this hands-on session, we will use a simple data set to create an interactive visualization ready for publication. We will look at how to quickly create maps in Tableau and how to make the final chart responsive so it can be seen on different devices.\n\nSoftware, data files and laptops are provided for the duration of the class. In the course of the session we will create a free account on Tableau Public.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4283",
        "event_url": "https://ire.org/events-and-training/event/3433/4283/"
    },
    {
        "title": "Archiving digital journalism",
        "type": "Panel",
        "description": "Digital journalism is disappearing. Chances are, if you read a cool piece of interactive journalism on the web today, that same story won't be online in two years. How can we stop this erosion? How can you, as an individual journalist, make sure that your clips remain available online after you switch jobs? In this panel, journalists and librarians will explain how tools borrowed from libraries and from the field of reproducible scientific research can help ensure that we'll be able to read today's news on tomorrow's computers. We'll talk about ways to use the most popular online archiving site, the Internet Archive; we'll talk about simple strategies for saving visual journalism, and we'll give an update on an exciting new project to preserve news apps.",
        "speakers": "Katherine Boss of New York University; Ben Welsh of Los Angeles Times",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4160",
        "event_url": "https://ire.org/events-and-training/event/3433/4160/"
    },
    {
        "title": "Excel 1: Getting started with spreadsheets",
        "type": "Hands-on",
        "description": "In this introduction to spreadsheets, you'll begin analyzing data with Excel, a simple but powerful tool. You'll learn how to enter data, navigate spreadsheets and conduct simple calculations like sum, average and median.\n\nThis session is good for: Data beginners.",
        "speakers": "Stephanie Lamm of The Dallas Morning News",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4249",
        "event_url": "https://ire.org/events-and-training/event/3433/4249/"
    },
    {
        "title": "Finding the story: Open policing data",
        "type": "Hands-on",
        "description": "Researchers at Stanford University have collected and examined the records from millions of local police stops in more than 50 cities. Using the programming language R, learn how to analyze this local policing data and find patterns for stories.\n\nThis session is good for: People who have worked with data (or R) and want to learn how to analyze police data.",
        "speakers": "Dan Jenson of Stanford Computational Policy Lab; Cheryl Phillips of Stanford University; Amy Shoemaker of Stanford Computational Policy Lab",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4238",
        "event_url": "https://ire.org/events-and-training/event/3433/4238/"
    },
    {
        "title": "How and why to make your data analysis reproducible",
        "type": "Panel",
        "description": "You understand how you processed your data. Does your editor? Your reader? You, in six months? Without a replicable approach to extracting, transforming and loading data, we are often frustrated in our efforts to share or update our work. Join us for a panel discussion of reproducible data workflows. We’ll talk about why we use standardized processes for collecting, cleaning and analyzing data, and share practices that work for us. We’ll also discuss strategies for smart human intervention (i.e. reporting, logging and documentation) in automated workflows.",
        "speakers": "Ryann Grochowski Jones of ProPublica; Jeremy Singer-Vine of BuzzFeed News; Hannah Cushman of DataMade; Andrew Tran of The Washington Post",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4167",
        "event_url": "https://ire.org/events-and-training/event/3433/4167/"
    },
    {
        "title": "PDF 1: Using free online tools",
        "type": "Hands-on",
        "description": "This class will cover basic approaches for getting text out of PDF documents using powerful and freely available tools. Participants will be introduced to basic concepts and walked through tackling common challenges encountered with tricky PDF documents.\n\nThis session is good for: People who are unfamiliar with PDF-to-text tools or would like to learn how these tools can be used for extracting difficult text from images embedded in a PDF document.",
        "speakers": "Leah Becerra of The Kansas City Star",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4282",
        "event_url": "https://ire.org/events-and-training/event/3433/4282/"
    },
    {
        "title": "Python: Machine learning and natural language processing",
        "type": "Hands-on",
        "description": "How to use off-the-shelf unsupervised machine learning, natural language processing, and outlier detection algorithms to find and visualize patterns in data. Sample data includes the Internet Research Agency Facebook Ads released by the Democrats on the House Intelligence Committee.\n\nThis session is good for: People who have intermediate Python knowledge.",
        "speakers": "Jeff Kao of ProPublica",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4221",
        "event_url": "https://ire.org/events-and-training/event/3433/4221/"
    },
    {
        "title": "Regular expressions for the rest of us",
        "type": "Hands-on",
        "description": "Regular expressions are a powerful way to slice, dice and clean up dirty data — a must-know skill for anyone who works with data. They may look intimidating, but they are really just pattern-matching puzzles. We'll learn the fundamentals of \"regex\" so you save time cleaning your next batch of data.\n\nThis session is good for: People who have ever done more than two search/replace actions to clean a data set or had to split a ZIP code from an address or otherwise want to conquer their fears of regex.",
        "speakers": "Christian McDonald of University of Texas",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4231",
        "event_url": "https://ire.org/events-and-training/event/3433/4231/"
    },
    {
        "title": "SQL 1: Exploring data",
        "type": "Hands-on",
        "description": "Learning to manipulate data is a bit like learning a new language. Actually, it is a language, called structured query language (SQL). This session is an introduction to using SQL to zero in on your data by viewing slices and chunks of it and putting it into a useful order so you can spot the stuff you need to get started toward a story. We'll use SQLite and DB Browser, a free database manager.\n\nThis session is good for: People with some experience working with data in columns and rows, in spreadsheets or database managers.",
        "speakers": "Kendall Taggart of BuzzFeed News",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4254",
        "event_url": "https://ire.org/events-and-training/event/3433/4254/"
    },
    {
        "title": "Sports data viz with R",
        "type": "Hands-on",
        "description": "Sports is one area you won’t struggle to find data or a very interested audience. Learn how to turn some basic R into interesting looks into games, teams and seasons.\n\nThis session is good for: Anyone interested in R, visualizing data and sports. No previous experience with R is required.",
        "speakers": "Matt Waite of University of Nebraska - Lincoln",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4272",
        "event_url": "https://ire.org/events-and-training/event/3433/4272/"
    },
    {
        "title": "What the hell is D3? And other questions you're afraid to ask",
        "type": "Panel",
        "description": "Ever wondered what people are talking about at this conference? What exactly is D3 and why would you want to use it? What is the difference between Ruby, Python and Javascript? And why is there a J in front of Query? Welcome to our no-judgment, starting-at-step-zero session even NICAR veterans can use. We'll review tech concepts and jargon you'll likely hear at NICAR this year and explain what they mean, why they're useful and point you to the sessions that can teach you the terms you now understand.",
        "speakers": "Disha Raychaudhuri of NJ Advance Media; Mark Walker of The New York Times",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4181",
        "event_url": "https://ire.org/events-and-training/event/3433/4181/"
    },
    {
        "title": "Which coding language should I learn?",
        "type": "Panel",
        "description": "You're pretty good at spreadsheets, sure, but maybe you're bumping up against the limits of a tool designed only to clean and analyze data. You'd like to start querying relational databases, scraping websites, making API calls, running statistical tests and/or building custom visuals to help tell your stories. If this describes you, it might be time to learn to code. But which coding language is right for you? In this session, newsroom coders who speak some of the most popular programming languages (SQL, Python, R and JavaScript) discuss common uses for each and show you how to get started.",
        "speakers": "Armand Emamdjomeh of The Washington Post; Jennifer Peebles of The Atlanta Journal-Constitution; Ryan Murphy of The Texas Tribune; Christine Zhang of Baltimore Sun; Caitlin Ostroff of McClatchy",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4168",
        "event_url": "https://ire.org/events-and-training/event/3433/4168/"
    },
    {
        "title": "Year in CAR: Local innovation",
        "type": "Panel",
        "description": "So often the most celebrated examples of innovation in digital, visual and interactive journalism come from teams with uncommon access to resources and talent. You know the ones: The New York Times, The Washington Post, any number of digital-first startups — often on the coasts — that continually set the industry standard for digital innovation.\n\nThis panel isn't about those newsrooms. Instead, it will showcase the creative digital storytelling happening in local and regional newsrooms, where time and resources are scarce. The panel will be framed as a series of short talks and examples and will include an ability for journalists who cannot attend NICAR to present their work as well.",
        "speakers": "Chase Davis of Star Tribune",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4157",
        "event_url": "https://ire.org/events-and-training/event/3433/4157/"
    },
    {
        "title": "Master class: Leading the data team **pre-registered attendees only",
        "type": "Workshop",
        "description": "Experienced data journalists will share practical tips on how they've led their teams and convinced higher-ups to integrate data into the newsroom. Our instructors will show how they made it into leadership and how they excelled once they got there.\n\nTopics will include:\n\nThis class is ideal for data journalists who are looking to break into leadership and need guidance on how to get there or existing leaders who need tips on how to lead effectively.\n\nPreregistration is required and seating is limited.",
        "speakers": "Janet Roberts of Reuters; Troy Thibodeaux of The Associated Press",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4128",
        "event_url": "https://ire.org/events-and-training/event/3433/4128/"
    },
    {
        "title": "PyCAR *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nThis hands-on workshop will teach journalists basic programming concepts using the Python language. The daylong class will introduce language basics and useful libraries in the course of a typical reporting project: scraping data from the web, inserting it in a database and analyzing the results.\u2028\u2028 Although the class is geared toward beginners, we'll assume that you're comfortable with databases and SQL and that you've hopefully seen a command line since the days of DOS.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: Attendees should have familiarity with the command line and be comfortable with databases and SQL.\n\nThis class takes place on Thursday, March 7 from 9 a.m. - 12:30 p.m. and continues Friday, March 8, 9 a.m. - 12:30 p.m. (Registration for this session reserves your seat for both days of this workshop and attendees are expected to attend both sessions to complete the workshop.)\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Chris Keller of Los Angeles Times; Tom Meagher of The Marshall Project; Adriana Homolova of KRO-NCRV; Melissa Lewis of Reveal from The Center for Investigative Reporting; Roberto Rocha of CBC; Eric Sagara of Big Local News; Jacob Quinn Sanders of Factal; Aaron Williams of The Washington Post; Elaine Wong of CBC/Radio-Canada",
        "date": "2019-03-07",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon 5",
        "event_id": "3433/4086",
        "event_url": "https://ire.org/events-and-training/event/3433/4086/"
    },
    {
        "title": "Before you ever start your analysis",
        "type": "Panel",
        "description": "Don't just rush out and file that FOIA! Though requesting or finding data is often an early step in a data-driven story, not giving enough thought to what it is you're gathering can lead to weeks or months of delays, only to discover the data you get doesn’t fit your needs. We’ll show you why putting your reporting skills to work and planning your analysis before filing a public records request can pay off big time. We’ll give you a checklist of questions to ask and red flags to watch out for to ensure you get your story off to a good start.\n\nThis session will be interactive and prizes will be awarded to some lucky attendees.",
        "speakers": "Rob Barry of The Wall Street Journal; Jaimi Dowdell of Reuters; MaryJo Webster of Star Tribune",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4177",
        "event_url": "https://ire.org/events-and-training/event/3433/4177/"
    },
    {
        "title": "Digging into education data: From preschool to college",
        "type": "Panel",
        "description": "State and federal governments hold treasure troves of education data that reporters and news nerds can dig into to find great stories. Come learn how to parse the latest iteration of federal civil rights data (CRDC), which reveals resource and discipline inequities across the nation’s +96,000 schools. Find out the pros and cons of reporting with federal College Scorecard data, which tells the story of tuition and student debt across the nation’s +7,000 colleges. And hear an overview of the other great data sources that are available for education stories.",
        "speakers": "Andrea Fuller of The Wall Street Journal; Francisco Vara-Orta of IRE and NICAR; Annie Waldman of ProPublica",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4179",
        "event_url": "https://ire.org/events-and-training/event/3433/4179/"
    },
    {
        "title": "Excel 2: Formulas & sorting",
        "type": "Hands-on",
        "description": "Much of Excel's power comes in the form of formulas. In this class, you'll learn how to use them to analyze data with the eye of a journalist. Yes, math will be involved, but it's totally worth it! This class will show you how calculations like change, percent change, rates and ratios can beef up your reporting.\n\nThis session is good for: Anyone who is comfortable navigating Excel.",
        "speakers": "Sean Mussenden of Phillip Merrill College of Journalism",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4251",
        "event_url": "https://ire.org/events-and-training/event/3433/4251/"
    },
    {
        "title": "Finding your data story: Visual analytics best practices using Tableau (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Some experience working with data would be ideal.\n\nParticipants will get a crash-course in the fundamentals of Tableau, working with a slightly more complex dataset than we did in the introduction course. We will discuss how the data is shaped and will use Tableau to find an interesting story in the data, before turning it into a publishable visualization. Depending on the time available and the appetite of participants, we can also dive deeper into maps, simple statistical tools, or design best practices.\n\nSoftware, data files and laptops are provided for the duration of the class. The session is designed to follow the session “An introduction to Data Visualization with Tableau” but can also be taken on its own. Participants are expected to create a free account on Tableau Public before or at the beginning of the session.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4338",
        "event_url": "https://ire.org/events-and-training/event/3433/4338/"
    },
    {
        "title": "Geocoding and avoiding pitfalls",
        "type": "Hands-on",
        "description": "If you've had to place many addresses on a map before, you know how problematic bulk geocoding can be — technical issues, terms of service, fun, fun, fun! If you've never had the pleasure, don't worry, we'll show you how to happily (and correctly) geocode large sets of addresses. Learn how to use Geocod.io to turn rows of addresses into points on a map.\n\nThis session is good for: Anyone familiar with spreadsheets. No mapping experience necessary.",
        "speakers": "Michael Corey of Reveal from The Center for Investigative Reporting",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4247",
        "event_url": "https://ire.org/events-and-training/event/3433/4247/"
    },
    {
        "title": "Google Sheets: Scraping without coding",
        "type": "Hands-on",
        "description": "Yes, you can scrape data without using code -- in fact, all you need is Google Sheets! We'll be using Excel-type formulas (don't worry if you don't know what those are, either) to make simple scrapers that automatically pull data into Google Sheets. It’s the best way to get around clunky websites and unhelpful PIOs!\n\n**You must bring a laptop and have a Google account to participate in this session.\n\nThis session is good for: Beginners who want to start using data for their stories.",
        "speakers": "Samantha Sunne of independent journalist",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4236",
        "event_url": "https://ire.org/events-and-training/event/3433/4236/"
    },
    {
        "title": "Graph databases 1: Building a database",
        "type": "Hands-on",
        "description": "As data journalists, we're used to using relational databases — data organised in rows and columns such as a spreadsheet or SQL — to do our analysis and find stories. Graph databases are incredibly powerful for finding connections and patterns within our databases that would be difficult if not impossible to spot using traditional software. This session will provide a hands-on introduction to graph database Neo4j, showing examples of its use for investigative journalism including the Panama Papers, and teach you how to build your own graph database, importing public datasets to see at a glance the networks involved.\n\nThis session is good for: beginners to graph databases.",
        "speakers": "Leila Haddou of The Times & The Sunday Times; William Lyon of Neo4j",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4213",
        "event_url": "https://ire.org/events-and-training/event/3433/4213/"
    },
    {
        "title": "How to teach yourself code",
        "type": "Panel",
        "description": "You're a journalist with pretty much no coding experience who loves Excel and working with spreadsheets. You've attended IRE and NICAR for years and feel ready to make the leap but might be a little intimidated by code or have trouble finding the time to learn a new skill.\n\nLet's talk about the challenges to learning a programming language (whether Python, R, SQL or any other) and how to overcome them. Two self-taught coders will share their journeys and lessons they learned along the way.",
        "speakers": "Scott Pham of BuzzFeed News; C.J. Sinner of Star Tribune",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4156",
        "event_url": "https://ire.org/events-and-training/event/3433/4156/"
    },
    {
        "title": "PostgreSQL",
        "type": "Hands-on",
        "description": "This session will introduce you to PostgreSQL, a free, open source relational database system similar to MySQL and Microsoft SQL Server. We’ll cover the PostgreSQL ecosystem, from the database itself to management tools such as pgAdmin and psql. We’ll also dig into some of PostgreSQL’s unique and super-handy features, including the PostGIS spatial database extension, full-text search, and statistical functions.\n\nThis session is good for: People who have some database experience, but beginners are welcome too!",
        "speakers": "Anthony DeBarros of The Wall Street Journal",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4258",
        "event_url": "https://ire.org/events-and-training/event/3433/4258/"
    },
    {
        "title": "SQL 2: Grouping and summing data",
        "type": "Hands-on",
        "description": "If you know how to write a basic SELECT statement in SQL but are looking to make calculations, then this is the session for you. Learn to count how many times certain records appear in a database, and sum totals across records. These skills can come in handy whether you're covering campaign finance or boating licenses. We'll use SQLite and DB Browser, a free database manager.\n\nThis session is good for: People who took “SQL 1: Exploring data” or are familiar with “SELECT” and “WHERE” statements in SQL.",
        "speakers": "Matt Kiefer of The Chicago Reporter",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4255",
        "event_url": "https://ire.org/events-and-training/event/3433/4255/"
    },
    {
        "title": "Share your work: Publishing your data analysis with R",
        "type": "Hands-on",
        "description": "You will save time, produce better results, create more trusted analyses, reduce risk of errors and encourage collaboration by implementing reproducible data analysis workflow techniques. We will be going over tools like RMarkdown and interactive notebooks to weave together narrative text and code to produce formatted reports for sharing with collaborators (including your future self!). We will walk through hosting these reports and raw data files on GitHub. We will discuss best practices on how to structure your projects and repos.\n\nThis session is good for: R users interested in improving their workflow",
        "speakers": "Christine Zhang of Baltimore Sun",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4208",
        "event_url": "https://ire.org/events-and-training/event/3433/4208/"
    },
    {
        "title": "The state of data reporting outside major cities",
        "type": "Commons",
        "description": "What's life like for a data reporter who doesn't want to live in a major city? In this NICAR Commons session, talk to reporters who have been doing it for a long time and those just starting out.",
        "speakers": "Erin Mansfield of Tyler Morning Telegraph; Ryan Thornburg of The University of North Carolina at Chapel Hill",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4344",
        "event_url": "https://ire.org/events-and-training/event/3433/4344/"
    },
    {
        "title": "What’s new in Excel Online for analysis and visualization",
        "type": "Demo",
        "description": "Excel Online is free software that brings you features you’ve known and loved from Excel: you can now summarize your data with pivot tables, apply conditional formatting for report generation, all while collaborating with others.\n\nIn addition, intelligent cloud-backed Office365 features such as Stocks and Geography data types open up Excel/Excel Online to recognize more than text and numbers and Ideas in Excel helps you identify interesting trends and patterns in your data, providing charts with formatting and titles as well as accelerating data analysis and understanding.",
        "speakers": "Theresa Estrada of Microsoft",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4305",
        "event_url": "https://ire.org/events-and-training/event/3433/4305/"
    },
    {
        "title": "Which chart should I use, and why? Information design for the human brain!",
        "type": "Panel",
        "description": "We'll explore how research into the ways people estimate numbers will change how you think about choosing charts to tell your stories. And, no, it doesn't mean everything is a bar chart. We'll also discuss your problem charts and brainstorm improvements. Bring ideas for hard-to-visualize concepts and data.",
        "speakers": "Nathaniel Lash of The Philadelphia Inquirer; Casey Miller of Los Angeles Times; Ashlyn Still of Reuters; Jasmine Lee of The New York Times",
        "date": "2019-03-07",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4182",
        "event_url": "https://ire.org/events-and-training/event/3433/4182/"
    },
    {
        "title": "Avant garde data viz",
        "type": "Panel",
        "description": "You know all the rules of data viz — north belongs at the top of maps, timelines read left to right, bar charts are used for comparison. Now it's time to break the rules. This panel will explore when and why to break with convention, and when not to. We'll look at the best examples of unconventional data viz and show how you can mix up your own work in new and interesting ways.",
        "speakers": "Scott Klein of ProPublica; Nonny De La Peña of Emblematic Group; Rachel Binx of Netflix",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4397",
        "event_url": "https://ire.org/events-and-training/event/3433/4397/"
    },
    {
        "title": "Calling bullshit: Data reasoning in a digital world",
        "type": "Panel",
        "description": "The internet and information ecosystem today is awash in bullshit: junk science, fake news, biased algorithms, predatory publishing and on and on. Jevin West, a professor at the University of Washington, co-created a course to help students with the life skill of calling BS when necessary. West  will talk about one aspect of this course: statistical trickery. This session will touch on conditional probabilities, fallacies, biases and what to make of p-values.",
        "speakers": "Jevin West of University of Washington",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4193",
        "event_url": "https://ire.org/events-and-training/event/3433/4193/"
    },
    {
        "title": "Data journalism educators resource swap",
        "type": "Commons",
        "description": "If you teach a data journalism course or want to, join this NICAR Commons conversation and idea exchange. Bring your best teaching resources and assignments to share with others. And come ready to contribute to the discussion. What aspects of your courses and curriculum have produced the best results? What knowledge and skills do students need to secure an entry-level data reporting job? What data stories can students cover and add to their portfolio? How can we help IRE & NICAR update teaching resources?\n\nEducators: Upload your sample assignments, syllabi and discussion ideas for NICAR 2019.",
        "speakers": "Mark Berkey-Gerard of Rowan University; Dana Chinn of USC Annenberg School of Journalism",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4346",
        "event_url": "https://ire.org/events-and-training/event/3433/4346/"
    },
    {
        "title": "Excel 3: Filtering & pivot tables",
        "type": "Hands-on",
        "description": "A look at the awesome power of pivot — and how to use it to analyze your dataset in minutes rather than hours. We'll work up to using a pivot table by first sorting and filtering a dataset, learning how to find story ideas along the way.\n\nThis session is good for: Anyone familiar with formulas, sorting and filtering in Excel or another spreadsheet program.",
        "speakers": "Crina Boros of independent journalist",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4252",
        "event_url": "https://ire.org/events-and-training/event/3433/4252/"
    },
    {
        "title": "Excel for business & economics",
        "type": "Hands-on",
        "description": "Whether you just started using Excel or it's been your companion for years, chances are there's a lot it can do that you've never realized. We sometimes think of Excel as the stepping stone to database managers like Access or SQL Server, and overlook just how powerful its tools can be — especially if you're covering business and economics. Come find out why Excel is still so popular in the business world and we'll unlock some of its secrets. The people you're covering know these tricks — you should too.",
        "speakers": "Aaron Kessler of CNN",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4212",
        "event_url": "https://ire.org/events-and-training/event/3433/4212/"
    },
    {
        "title": "Finding the story: The state of immigration",
        "type": "Hands-on",
        "description": "Accusations are flying in the immigration debate and you can be prepared to document the truth. How many are coming, where are they coming from and why?  A hands-on look at how to use the data sources you need to follow the immigration debate nationally and in your town.\n\nThis session is good for: those familiar with Excel.",
        "speakers": "Tim Henderson of The Pew Charitable Trusts",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4219",
        "event_url": "https://ire.org/events-and-training/event/3433/4219/"
    },
    {
        "title": "From messy data to insightful story: Cleaning data using Tableau (Hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Some experience working with data and is necessary; knowledge of Tableau Desktop/Tableau Public would be ideal.\n\nParticipants will get a crash-course in the fundamentals of Tableau Prep. We will work with a couple of messy real-world data sets. We will clean, shape, and merge our data in Tableau Prep with the aim of analyzing it in Tableau Desktop and finally publishing an interactive chart with Tableau Public.\n\nSoftware, data files and laptops are provided for the duration of the class. The session is designed to follow the sessions “An introduction to Data Visualization with Tableau” and “Finding your data story: Visual analytics best practices using Tableau” but can also be taken on its own by participants who have some experience in working with data. Participants are expected to create a free account on Tableau Public before or at the beginning of the session.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4339",
        "event_url": "https://ire.org/events-and-training/event/3433/4339/"
    },
    {
        "title": "Graph databases 2: Finding stories in data",
        "type": "Hands-on",
        "description": "Learn to analyze your newly built graph database using Cypher, Neo4j's query language. It is advisable to have completed part one to get the most out of this session, however, it is not strictly necessary. We will show how to find stories in the data by analyzing the combined datasets using the Cypher query language in Neo4j. We will also explore more advanced graph database concepts such as applying graph algorithms and graph visualization.\n\nThis session is good for: Those who attended Graph databases 1, or those already familiar with Neo4j.",
        "speakers": "Leila Haddou of The Times & The Sunday Times; William Lyon of Neo4j",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4273",
        "event_url": "https://ire.org/events-and-training/event/3433/4273/"
    },
    {
        "title": "Making the leap from Excel to R",
        "type": "Panel",
        "description": "R might sound intimidating because it’s a programming language, but you might be surprised to learn that the leap from Excel to R isn’t as big as you might think, thanks to the RStudio interface and lots of simple-to-use R packages. We’ll go through the pros and cons between the two software tools and give you tips on how to make the transition as smooth as possible, should you decide to go that route. This will be for those who are comfortable in Excel but have no experience with R and would just like to get a taste of it before diving into a hands-on class.",
        "speakers": "MaryJo Webster of Star Tribune",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4138",
        "event_url": "https://ire.org/events-and-training/event/3433/4138/"
    },
    {
        "title": "Python 101: An overview for total beginners",
        "type": "Panel",
        "description": "Come learn how newsrooms are using the Python programming language to analyze data, scrape the web, build web applications and more. This lecture will answer basic questions about what Python is, how it's used and how you can get started learning.",
        "speakers": "Mindy McAdams of University of Florida",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4192",
        "event_url": "https://ire.org/events-and-training/event/3433/4192/"
    },
    {
        "title": "SQL 3: Joining tables",
        "type": "Hands-on",
        "description": "Learn how to join tables, matching information from one file to another. We'll use SQLite and DB Browser, a free database manager.\n\nThis session is good for: People who are familiar with counting, summing or “GROUP BY” in SQL and want to add another tool to their SQL skill set.",
        "speakers": "Chad Day of The Associated Press",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4256",
        "event_url": "https://ire.org/events-and-training/event/3433/4256/"
    },
    {
        "title": "Self care for journalists: A practical guide",
        "type": "Panel",
        "description": "Layoffs. Climate-change disasters. Fake news. Corruption. Mass shootings. Angry sources. Vitriolic culture. Enemy of the people.\n\nJournalism has never been an easy job but in our current culture, the psychic, emotional and sometimes financial toll seems to keep mounting. So how do we thrive — or even survive — in such an atmosphere? This session will cover how to recognize signs of burnout, secondary trauma and other danger signs, as well as the research that shows what can really help, how to train your editor and how to build a support network. We'll also look at how professionals deal with constant trauma in other fields. The good news: the practices and tools you can develop to survive as a journalist – growing resilience, cultivating empathy and self-advocacy – are the same tools that can help you succeed in the rest of your life.",
        "speakers": "Kristin Hussey of independent journalist; Christine Mehta of Syracuse University, Newhouse School; Jodi Upton of Syracuse University; Linda Yaron of University of Southern California",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4149",
        "event_url": "https://ire.org/events-and-training/event/3433/4149/"
    },
    {
        "title": "Text mining in R with tidytext",
        "type": "Hands-on",
        "description": "Do you want to analyze the themes, sentiment, and complexity of every State of the Union address, or analyze how Members of congress responded on Twitter to @realDonaldTrump? This session will introduce you to the tools needed to tackle these and other challenges in text analysis in R, using the tidytext package.\n\nThis class is good for: those who are familiar with the basics of the tidyverse.",
        "speakers": "Peter Aldhous of BuzzFeed News",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4210",
        "event_url": "https://ire.org/events-and-training/event/3433/4210/"
    },
    {
        "title": "Using Datawrapper to quickly create charts and maps",
        "type": "Hands-on",
        "description": "Datawrapper is an increasingly popular online tool for visualizing data. This class will walk students through the creation of multiple types of charts and maps.\n\n**You must bring a laptop (and charger) to this session and sign up for a free account at datawrapper.de.\n\nThis session is good for beginners looking for a data visualization solution that doesn't require learning to code.",
        "speakers": "Gus Wezerek of FiveThirtyEight",
        "date": "2019-03-07",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4144",
        "event_url": "https://ire.org/events-and-training/event/3433/4144/"
    },
    {
        "title": "Journalists of color in the newsroom meetup",
        "type": "Special Event",
        "description": "Grab lunch and bring a brown bag for this networking and discussion session with other journalists of color. IRE & NICAR will provide drinks and dessert.",
        "speakers": "Disha Raychaudhuri of NJ Advance Media; Soo Oh of The Wall Street Journal",
        "date": "2019-03-07",
        "time_start": "12:45",
        "time_end": "14:00",
        "length_in_hours": 1.25,
        "room": "Cardiff",
        "event_id": "3433/4359",
        "event_url": "https://ire.org/events-and-training/event/3433/4359/"
    },
    {
        "title": "After a disaster: Long-term reporting on floods, fires and other emergencies",
        "type": "Panel",
        "description": "We’ll talk about databases and documents you can use to cover natural and unnatural disasters before, during and after they occur, and strategies for identifying long-term issues after the initial incident.",
        "speakers": "Rebecca Hersher of NPR; Eric Sagara of Big Local News; Lisa Song of ProPublica",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4176",
        "event_url": "https://ire.org/events-and-training/event/3433/4176/"
    },
    {
        "title": "An introduction to data visualization with Tableau (repeat, hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Beginner.\n\nParticipants will get an introduction to Tableau and the Tableau Public platform. In this hands-on session, we will use a simple data set to create an interactive visualization ready for publication. We will look at how to quickly create maps in Tableau and how to make the final chart responsive so it can be seen on different devices.\n\nSoftware, data files and laptops are provided for the duration of the class. In the course of the session we will create a free account on Tableau Public.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4340",
        "event_url": "https://ire.org/events-and-training/event/3433/4340/"
    },
    {
        "title": "Become an instant expert",
        "type": "Demo",
        "description": "Are you looking for sources on social media, government websites, academic papers? What if you're looking for local Facebook pages about Donald Trump, but Trump's page himself keeps popping up? What if you're looking for government reports on Obamacare and you keep getting weird health blogs? What if you could filter all this out with a little website called Google dot com? We'll go over some of the lesser-known Google filters like \"related:\", \"location:\" and \"-inurl:\"",
        "speakers": "Daniel Russell of Google",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4356",
        "event_url": "https://ire.org/events-and-training/event/3433/4356/"
    },
    {
        "title": "Building your own database",
        "type": "Hands-on",
        "description": "In this hands-on session we'll turn some paper records into machine-readable data. Along the way we'll learn the best practices of structuring a data set and entering data, and we'll talk about pitfalls such as data types, unstandardized data and memo fields.\n\n**You must bring a laptop and have a Google account to participate in this session.\n\nThis session is good for: Anyone familiar with the basics of spreadsheets and frustrated by paper records.",
        "speakers": "Steven Rich of The Washington Post",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4218",
        "event_url": "https://ire.org/events-and-training/event/3433/4218/"
    },
    {
        "title": "Covering the 2020 Census",
        "type": "Panel",
        "description": "Census 2020 is less than a year away, and many different kinds of reporting will be required to adequately cover it. From lawsuits and policies to misinformation campaigns on social media, to the new changes to differential privacy rules around data release, a journalist working the census has a vast beat.\n\nLocal outlets have a special responsibility to make sure their communities are informed of the impact of being adequately counted. This means stories that underscore the importance of a good count (for both political as well as economic reasons -- nearly $900 billion a year in federal funds will return to communities based on these counts), and make sure their vulnerable populations are being addressed.\n\nThis panel discussion will cover the different aspects involved in adequately covering the 2020 Census, including both Census officials and journalists currently on the beat.",
        "speakers": "Mark Hansen of Columbia Journalism School; Jodi Upton of Syracuse University; Gerson Vasquez of Census Bureau; Hansi Wang of NPR",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4161",
        "event_url": "https://ire.org/events-and-training/event/3433/4161/"
    },
    {
        "title": "Finding the story: Covering class and poverty at the local level",
        "type": "Hands-on",
        "description": "A discussion touching on the unseen aspects of covering class and poverty. This session will include an overview of key sources and documents and a guided exploration of data sets that can help you tell important but undercovered stories in your community.\n\nThis session is good for: Everyone!",
        "speakers": "Heather Bryant of Project Facet",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4267",
        "event_url": "https://ire.org/events-and-training/event/3433/4267/"
    },
    {
        "title": "How it works: The internet (for journalists who want to scrape it)",
        "type": "Panel",
        "description": "If you want to scrape a website, it helps to understand a little bit about how the internet works under the hood. In this session, we’ll talk a little bit about the internet works, how it differs from the web and how to examine source code and network traffic to target and scrape newsworthy information. There will be an optional component where you can run commands from your computer that help illustrate these points, but you’ll also just be able to follow the presentation.",
        "speakers": "Melissa Lewis of Reveal from The Center for Investigative Reporting",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4173",
        "event_url": "https://ire.org/events-and-training/event/3433/4173/"
    },
    {
        "title": "How it works: Version control for journalists (git/GitHub)",
        "type": "Panel",
        "description": "Branching, forking, merging and cloning. Version control can be a complicated issue, but this session for beginners will show you how newsrooms are using this technology to solve real-world problems.\n\nThis session is ideal to attend before the hands-on class in GitHub.",
        "speakers": "Daniel Nguyen of independent journalist",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4174",
        "event_url": "https://ire.org/events-and-training/event/3433/4174/"
    },
    {
        "title": "How to help your TV newsroom achieve a data journalism mindset",
        "type": "Commons",
        "description": "Data journalism is a staple in many print newsrooms and for most investigative teams. But TV newsrooms have historically shied away from telling stories with data because it's complex, time consuming and hard to explain in a visual and entertaining way. Here's the good news: It doesn't have to be so daunting! Our team at KING-TV teamed up with data experts at Microsoft to find visually-compelling ways to integrate data into the daily mix. We came up with a style that shines on all platforms. In this NICAR Commons session, we'll share key takeaways from our journey, swap practical tips for building a newsroom culture that embraces data storytelling, and we'll work together to remove roadblocks on your path to achieving the data journalism mindset.",
        "speakers": "Taylor Mirfendereski of KING5 Seattle; Jake Whittenberg of KING5 Seattle",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4345",
        "event_url": "https://ire.org/events-and-training/event/3433/4345/"
    },
    {
        "title": "Python 1: The fundamentals",
        "type": "Hands-on",
        "description": "Learning a programming language is much like learning to write a news story. There are certain styles and conventions to follow, a standard order, etc. In this session geared toward absolute beginners, we’ll get started with some of the basics of this new language.\n\nThis session is good for: People who are comfortable working with data in spreadsheets or database managers and want to make the leap to programming.",
        "speakers": "Sandra Fish of independent journalist",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4239",
        "event_url": "https://ire.org/events-and-training/event/3433/4239/"
    },
    {
        "title": "R 1: Intro to R and RStudio",
        "type": "Hands-on",
        "description": "Learn your way around the basics of RStudio. We’ll load basic packages to do data analysis, read in some data and explore it. This is a good class to learn the basic structure of writing R code. You’ll leave knowing how to get data into R, how to do some cleaning and formatting tasks and how to start doing basic analysis on a dataset. This will give you more confidence to take the next steps in your analyses.\n\nThis session is good for: beginner to intermediate users.",
        "speakers": "Meghan Hoyer of The Associated Press",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4242",
        "event_url": "https://ire.org/events-and-training/event/3433/4242/"
    },
    {
        "title": "Stats in Excel",
        "type": "Hands-on",
        "description": "You don't need a special statistics program to run simple statistical analysis. In this session, you'll learn how to compute some basic statistics in Excel and figure out what they mean.\n\nThis session is good for: People who already are comfortable with using functions in Excel.",
        "speakers": "Steve Doig of ASU Walter Cronkite School of Journalism",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4232",
        "event_url": "https://ire.org/events-and-training/event/3433/4232/"
    },
    {
        "title": "First Observable notebook: Prototyping with polish **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Advanced\n\nSahil Chinoy, Iris Lee, Ben Welsh and Aaron Williams teach you how to rapidly prototype a complex data visualization with JavaScript, D3.js and an interactive Observable notebook.\n\nThis three-hour, hands-on course will show you how journalists are putting Observable’s powerful potential to work. Using nothing but your web browser, you will sketch, refine and publish an interactive graphic like one that appeared in The New York Times. Along the way, you’ll see how Observable’s groundbreaking approach to coding can help you be more creative, ambitious and efficient.\n\nPreregistration is required and seating is limited. Laptops will be provided.\n\nWorkshop prerequisites: If you’ve used JavaScript once or twice, have a good attitude and know how to take a few code crashes in stride, you are qualified for this class. If you’re suspicious and think we might be Internet hipsters, we welcome the challenge of winning you over. This stuff is cool.",
        "speakers": "Sahil Chinoy of The New York Times; Iris Lee of Los Angeles Times; Ben Welsh of Los Angeles Times; Aaron Williams of The Washington Post",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4109",
        "event_url": "https://ire.org/events-and-training/event/3433/4109/"
    },
    {
        "title": "Interviewing your data with SQL **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nIf you flip over pivot tables, but wish you had more data tools, this session is for you. Structured Query Language, or SQL, can help you use powerful filtering functions, find patterns in millions of records and join multiple data tables.\n\nThis class will be taught by two experienced data reporters and former IRE trainers, and materials will include the IRE Computer-Assisted Reporting boot camp binder, full of exercises, cheat sheets and tips to help you boost your data analysis and storytelling skills. We will use a free database manager that can be easily installed and used on any computer.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: The only prerequisites are a reasonable comfort level with using a spreadsheet. No previous SQL skills necessary.\n\nThis class takes place on Thursday, March 7 from 2:15-5:45 p.m. and continues Friday, March 8, 9 a.m. - 12:30 p.m. (Registration for this session reserves your seat for both days of this workshop and attendees are expected to attend both sessions to complete the workshop.)\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Elizabeth Lucas of Kaiser Health News; Megan Luther of InvestigateTV",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 4",
        "event_id": "3433/4113",
        "event_url": "https://ire.org/events-and-training/event/3433/4113/"
    },
    {
        "title": "Intro to R (Thursday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nHannah Fresques and Sandhya Kambhampati of ProPublica, along with MaryJo Webster of the Minneapolis Star Tribune, will introduce you to R, a free, powerful open-source programming language, that will add statistical heft to your reporting. By the end of this three-hour session, you will be able to take raw data, import it into R, and start your analysis. Topics will include basic data importing, working with directories, reading in data, installing packages, creating simple visualizations, and how to clean, explore and sort your data. We'll also talk about how to find help when you're stuck.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: This session will be most helpful if you’re comfortable working with data and you’re ready to take your skills to the next level.",
        "speakers": "Hannah Fresques of ProPublica; Sandhya Kambhampati of ProPublica Illinois; MaryJo Webster of Star Tribune",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 3",
        "event_id": "3433/4091",
        "event_url": "https://ire.org/events-and-training/event/3433/4091/"
    },
    {
        "title": "Master class: Self-editing & bulletproofing the data **pre-registered attendees only",
        "type": "Workshop",
        "description": "Data-driven stories can overwhelm a writer juggling data and storytelling and leave even the best editors feeling out of their depth. In this half-day workshop, we’ll focus on the core data editing and bulletproofing skills every journalist should have, whether you are a hands-on data journalist or an editor supervising this work.\n\nTwo data journalists, Atlanta Journal Constitution’s deputy managing editor Shawn McIntosh and Washington Post investigative reporter Kimbriell Kelly, will share lessons they have learned writing and presenting data-driven stories. You will receive tips and strategies from an editor's and reporter's point of view, including:\n\nWhether you want to get better at editing yourself or others, we’ll have tips and resources for you. No data experience is required for this workshop.\n\nBring questions and examples as there will be plenty of time for discussion.\n\nPreregistration is required and seating is limited.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Kimbriell Kelly of The Washington Post; Shawn McIntosh of The Atlanta Journal-Constitution",
        "date": "2019-03-07",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4129",
        "event_url": "https://ire.org/events-and-training/event/3433/4129/"
    },
    {
        "title": "Building a data library in your newsroom",
        "type": "Panel",
        "description": "Stockpiling data helps your newsroom be ready for breaking news, mine data for tips, provides context for multiple stories, offers content for visualizations, and build data literacy among reporters, editors and producers. But there are crucial questions to ask before you build your data arsenal: What databases does your newsroom need? What databases will be used for more than one story, serve as a reference library and improve with annual updates? What technology should you use to house data and what tools would make it accessible across the newsroom? What metadata and documentation should be attached?",
        "speakers": "Acton Gorton of Chicago Tribune; Brant Houston of University of Illinois; Meghan Hoyer of The Associated Press",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4171",
        "event_url": "https://ire.org/events-and-training/event/3433/4171/"
    },
    {
        "title": "Doxxing for good: Tracing your online footprint before hackers can",
        "type": "Demo",
        "description": "In this demo Kristen Kozinski and Neena Kapur from The New York Times Information Security team will share their experience creating a doxxing education program in their newsroom. They’ll cover why doxxing is a threat to reporters, recommended tools and techniques for cleaning up your online footprint, and suggestions for implementing a doxxing program in your newsroom.",
        "speakers": "Neena Kapur of The New York Times; Kristen Kozinski of The New York Times",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4201",
        "event_url": "https://ire.org/events-and-training/event/3433/4201/"
    },
    {
        "title": "Excel: Using string functions to reformat data",
        "type": "Hands-on",
        "description": "Maybe you converted a PDF or imported a table into Excel -- or maybe an agency gave you a poorly formatted file. You can use string functions to reformat your data and get your spreadsheets working for you.\n\nThis session is good for: Anyone comfortable with using formulas in Excel.",
        "speakers": "Rachel Alexander of Salem Reporter",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4266",
        "event_url": "https://ire.org/events-and-training/event/3433/4266/"
    },
    {
        "title": "Finding your data story: Visual analytics best practices using Tableau (repeat, hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Some experience working with data would be ideal.\n\nParticipants will get a crash-course in the fundamentals of Tableau, working with a slightly more complex dataset than we did in the introduction course. We will discuss how the data is shaped and will use Tableau to find an interesting story in the data, before turning it into a publishable visualization. Depending on the time available and the appetite of participants, we can also dive deeper into maps, simple statistical tools, or design best practices.\n\nSoftware, data files and laptops are provided for the duration of the class. The session is designed to follow the session “An introduction to Data Visualization with Tableau” but can also be taken on its own. Participants are expected to create a free account on Tableau Public before or at the beginning of the session.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4364",
        "event_url": "https://ire.org/events-and-training/event/3433/4364/"
    },
    {
        "title": "How to make data a routine part of your beat",
        "type": "Panel",
        "description": "Data-driven stories don’t have to be relegated to the enterprise stories that we spend a lot of time on. Pretty much every beat should have some data source(s) that you can be monitoring & requesting regularly, or there might be datasets you can build on your own, that help generate stories. We’ll also talk about how to scope out your beat to find data sources at the outset.",
        "speakers": "Angela Caputo of APM Reports; John Harden of The Washington Post; Brandon Quester of inewsource",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4137",
        "event_url": "https://ire.org/events-and-training/event/3433/4137/"
    },
    {
        "title": "Machine learning and investigative reporting",
        "type": "Panel",
        "description": "Has your editor ever asked for a couple of examples? What if you could use machine learning to find some of those examples and investigate a real phenomenon?\n\nJoin reporters who have used machine learning as a tool in investigative reporting. You’ll hear about how we used machine learning to find patients whose deaths were potentially linked to medical devices; tracked fake news and identified illegal ads on Facebook; investigated potential campaign finance fraud; and did financial muckraking in the tax records of a global financial corporation.\n\nWe’ll answer important questions like: What is machine learning? What kind of stories could it help with? and What do you need to take into account to get started?",
        "speakers": "Meredith Broussard of New York University; Emilia Diaz-Struck of The International Consortium of Investigative Journalists; Jeff Ernsthausen of ProPublica",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4150",
        "event_url": "https://ire.org/events-and-training/event/3433/4150/"
    },
    {
        "title": "Python 2: Intro to data analysis using pandas",
        "type": "Hands-on",
        "description": "Imagine rolling Excel and MySQL into one tool that also allows you to track your code and share it. That’s pandas in a nutshell. There’s a lot more you can do with it, of course, but this will be a good start. We’ll learn how to slice and dice our data and extract basic stats. Specifically, we’ll cover loading the data, filtering, sorting and grouping data.\n\nThis class is good for: People who are comfortable with Excel and are familiar with the basics of SQL and Python.",
        "speakers": "Lam Thuy Vo of BuzzFeed News",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4240",
        "event_url": "https://ire.org/events-and-training/event/3433/4240/"
    },
    {
        "title": "R 2: Data analysis and plotting in R",
        "type": "Hands-on",
        "description": "We'll use the tidyverse packages dplyr and ggplot2, learning how to sort, filter, group, summarize, join and visualize to identify trends in your data. If you want to combine SQL-like analysis and charting in a single pipeline, this session is for you.\n\nThis session is good for: People who have worked with data operations in SQL or Excel and would like to do the same in R.",
        "speakers": "Ronald Campbell of NBC Owned Television Stations",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4243",
        "event_url": "https://ire.org/events-and-training/event/3433/4243/"
    },
    {
        "title": "R: Intro stats in R",
        "type": "Hands-on",
        "description": "Learn how to use R to spot trends and identify relationships in data using social science theories and methods. In this session, we will use R for statistical significance tests, cross-tabulations and linear regression.\n\nThis session is good for: Anyone who is comfortable working with spreadsheets and database managers and wants to learn how to do basic statistical analysis. Some experience with R will be helpful.",
        "speakers": "Olga Pierce of University of Nebraska - Lincoln",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4245",
        "event_url": "https://ire.org/events-and-training/event/3433/4245/"
    },
    {
        "title": "Students' roundtable",
        "type": "Commons",
        "description": "This is a roundtable for students to have an honest, off-the-record discussion on the challenges of being a student journalist. Some of the topics that might be brought up include: learning to set aside your personal biases, gaining access to data and documents, and backlash from your university for unfavorable coverage.",
        "speakers": null,
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4357",
        "event_url": "https://ire.org/events-and-training/event/3433/4357/"
    },
    {
        "title": "The IRE Principles (Code of Conduct): A conversation with the IRE Board of Directors",
        "type": "Panel",
        "description": "Several members of the IRE Board of Directors will be on hand to discuss the recent changes to the IRE Principles (Code of Conduct). This session is designed to be a conversation -- not a presentation -- so bring your questions.",
        "speakers": "Matt Dempsey of Houston Chronicle; Doug Haddix of IRE and NICAR; Jennifer LaFleur of Investigative Reporting Workshop; T. Christian Miller of ProPublica; Steven Rich of The Washington Post; Jill Riepenhoff of InvestigateTV; Norberto Santana of Voice of OC; Cheryl W. Thompson of NPR; Jodi Upton of Syracuse University; Nicole Vap of KUSA/9Ne",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4363",
        "event_url": "https://ire.org/events-and-training/event/3433/4363/"
    },
    {
        "title": "Workbench: Reproducible data work without coding",
        "type": "Hands-on",
        "description": "Workbench is an open source tool that puts all stages of the data journalism process in one workspace, including scraping, cleaning, monitoring, and visualization -- all without coding, and all reproducible.\n\nIn this hands-on tutorial, you'll learn how to use Workbench for several different newsroom tasks. Clean and explore data, monitor sources, create live embeddable charts that update when new data is released, or build useful queries that other journalists can use to report on a data set. Workbench is built to help make data tasks accessible to more people in the newsroom.\n\n**You must bring a laptop, with either Google Chrome or Firefox web browsers installed, to participate in this class.\n\nThis session is good for journalists of all skill levels.",
        "speakers": "Jonathan Stray of Columbia Journalism School",
        "date": "2019-03-07",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4215",
        "event_url": "https://ire.org/events-and-training/event/3433/4215/"
    },
    {
        "title": "Excel: Importing data",
        "type": "Hands-on",
        "description": "Not all data comes in ready-to-use, elegant spreadsheets. This session will teach you how to import data from text files and website tables. We will look at how to clean and organize data that may not come in the friendliest format.\n\nThis session is good for: Anyone comfortable with working in Excel.",
        "speakers": "Manuel Villa of The Marshall Project",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4260",
        "event_url": "https://ire.org/events-and-training/event/3433/4260/"
    },
    {
        "title": "From messy data to insightful story: Cleaning data using Tableau (repeat, hosted by Tableau)",
        "type": "Hands-on",
        "description": "Skill level: Some experience working with data and is necessary; knowledge of Tableau Desktop/Tableau Public would be ideal.\n\nParticipants will get a crash-course in the fundamentals of Tableau Prep. We will work with a couple of messy real-world data sets. We will clean, shape, and merge our data in Tableau Prep with the aim of analyzing it in Tableau Desktop and finally publishing an interactive chart with Tableau Public.\n\nSoftware, data files and laptops are provided for the duration of the class. The session is designed to follow the sessions “An introduction to Data Visualization with Tableau” and “Finding your data story: Visual analytics best practices using Tableau” but can also be taken on its own by participants who have some experience in working with data. Participants are expected to create a free account on Tableau Public before or at the beginning of the session.",
        "speakers": "Florian Ramseger of Tableau Software; Jonni Walker of Tableau Software",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4365",
        "event_url": "https://ire.org/events-and-training/event/3433/4365/"
    },
    {
        "title": "GitHub for journalists",
        "type": "Hands-on",
        "description": "We'll cover Github's basics features  — repositories, commits, branches, pull requests and issues — using a recent data-driven story as a case study. The goal is for you to leave the class and be able to use GitHub on your own for your next story.\n\n**You must bring a laptop to participate in this class. You will also need to create an account at GitHub.com and install GitHub Desktop prior to the class.\n\nThis session is good for: Journalists who want to collaborate on data analyses, back up their work and share their methodology with (nerdy) readers",
        "speakers": "Brent Jones of St. Louis Public Radio",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4269",
        "event_url": "https://ire.org/events-and-training/event/3433/4269/"
    },
    {
        "title": "How it works: APIs",
        "type": "Panel",
        "description": "What is an Application Programming Interface (API), and how are journalists using them to power newsroom projects? Come to this session to get an overview of how APIs work and some ideas for integrating them into your own data projects.\n\nThis session is ideal for API beginners to attend before the hands-on class \"A hitchhiker's guide to APIs.\"",
        "speakers": "Jonathan Soma of Columbia Journalism School",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4172",
        "event_url": "https://ire.org/events-and-training/event/3433/4172/"
    },
    {
        "title": "How to impress the boss & save democracy: Data stories you can turn in 30 days or less",
        "type": "Panel",
        "description": "Beginners to seasoned data journalists will learn about easy-to-find, easy-to-navigate datasets that lead to quick-turn watchdog stories. We’ll show examples across beats. You’ll leave this panel with a notebook full of story ideas that you can tackle as soon as you return to your newsroom.",
        "speakers": "Holly Hacker of The Dallas Morning News; Jill Riepenhoff of InvestigateTV",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4195",
        "event_url": "https://ire.org/events-and-training/event/3433/4195/"
    },
    {
        "title": "Intro to web development",
        "type": "Hands-on",
        "description": "If you've been trying to figure out what all the fuss is about HTML, CSS and JavaScript, this session is for you. This session will introduce you to the basics of web development, help you make sense of the jargon and answer your questions. At the end of the session, you will have built a simple web page using HTML, CSS and JavaScript.\n\nThis session is good for: Beginners in web development. No coding experience required.",
        "speakers": "Melissa Lewis of Reveal from The Center for Investigative Reporting",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4235",
        "event_url": "https://ire.org/events-and-training/event/3433/4235/"
    },
    {
        "title": "Investigating nonprofits with data",
        "type": "Demo",
        "description": "We'll show reporters at all levels how to work with nonprofit data. We'll walk you through spreadsheets and databases that contain information on how nonprofits are spending their money and give you tips for identifying red flags. We'll also talk about digitized 990 filings and how you or other programmers in your newsroom can parse the data and root out corruption.",
        "speakers": "Andrea Fuller of The Wall Street Journal; Todd Wallack of The Boston Globe",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4350",
        "event_url": "https://ire.org/events-and-training/event/3433/4350/"
    },
    {
        "title": "NICAR-L improvement project",
        "type": "Commons",
        "description": "Help make the NICAR-L archives more user-friendly by creating ways to identify and surface useful posts and threads. We'll discuss possible new ways to access the archives, a basic app to make things like up-voting and categorization possible and an initial roadmap. During this session, we will gather ideas and create a plan that we'll continue working on after the conference.",
        "speakers": "Derek Willis of ProPublica",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4362",
        "event_url": "https://ire.org/events-and-training/event/3433/4362/"
    },
    {
        "title": "Preparing for the future of disinformation and deep fakes",
        "type": "Panel",
        "description": "Recent advances in artificial intelligence make it easy to generate believable video and audio. It seems likely that these techniques will see usage in the political arena, where the ability to cheaply generate high fidelity hoaxes might be an attractive option for state and nonstate actors seeking to manipulate discourse and voter behavior.\n\nJournalists, tasked with evaluating the quality of information, will be on the front lines confronting these new threats as they emerge. Learn what tools exist to detect potential fakes, what machine learning can and can’t do, who is fighting the potential spread of synthetic videos and what we can do about it.\n\nThis session was sponsored by Knight Foundation. IRE retains control of content, including the topic and speaker selection, for all conference sessions.",
        "speakers": "Paul Cheung of Knight Foundation; Christine Glancey of The Wall Street Journal; Sam Gregory of WITNESS",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4159",
        "event_url": "https://ire.org/events-and-training/event/3433/4159/"
    },
    {
        "title": "Python 3: Data cleaning and visualization",
        "type": "Demo",
        "description": "Now that you’ve got a handle on pandas, it’s time to jump into some advanced topics. You know how to import a dataset, but what happens when you load the data and nothing looks right? We’ll walk through cleaning up a dirty dataset with pandas. Then we’ll jump into the fun part: visualizing the data you’ve analyzed with matplotlib.\n\nThis session is good for: People who can load and perform basic summary and grouping functions in pandas.",
        "speakers": "Karrie Kehoe of ICIJ-Ctr for Public Integrity",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4241",
        "event_url": "https://ire.org/events-and-training/event/3433/4241/"
    },
    {
        "title": "R 3: Gathering and cleaning data in R",
        "type": "Hands-on",
        "description": "Learn how to use R to collect information from web pages and transform the results into usable data. This session will also teach you how to clean and structure data for analysis using the tidyverse and other packages.\n\nThis session is good for: People who have used R and database software.",
        "speakers": "Ronald Campbell of NBC Owned Television Stations",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4244",
        "event_url": "https://ire.org/events-and-training/event/3433/4244/"
    },
    {
        "title": "Using data to report on racial inequality",
        "type": "Panel",
        "description": "Hear from journalists on the front lines of investigating racial, socioeconomic and other inequalities. Get story ideas as well as reporting and writing tips, along with advice on how best to frame stories in the proper historical context. Relevant public records and data sets also will be discussed.",
        "speakers": "Bracey Harris of The Clarion-Ledger; Alden Loury of WBEZ  Public Radio; Emmanuel Martinez of Reveal from The Center for Investigative Reporting",
        "date": "2019-03-07",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4190",
        "event_url": "https://ire.org/events-and-training/event/3433/4190/"
    },
    {
        "title": "Welcome Reception and celebration of the 25th CAR Conference (Sponsored by Google News Initiative)",
        "type": "Reception",
        "description": "Join us for a special celebration of the 25th CAR conference during our welcome reception on Thursday, beginning at 6 p.m. Reconnect with longtime friends, welcome new attendees and meet special surprise guests! Each attendee will receive one drink ticket for beer, wine, soda or bottled water. Light snacks also will be served.",
        "speakers": null,
        "date": "2019-03-07",
        "time_start": "18:00",
        "time_end": "19:00",
        "length_in_hours": 1.0,
        "room": "Rose Garden",
        "event_id": "3433/4372",
        "event_url": "https://ire.org/events-and-training/event/3433/4372/"
    },
    {
        "title": "Mentoring Breakfast (Sponsored by Donald W. Reynolds Journalism Institute) **invitation-only event",
        "type": "Special Event",
        "description": null,
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "07:30",
        "time_end": "08:45",
        "length_in_hours": 1.25,
        "room": "Baycliff",
        "event_id": "3433/4373",
        "event_url": "https://ire.org/events-and-training/event/3433/4373/"
    },
    {
        "title": "CAR Conference registration (Friday)",
        "type": "Special Event",
        "description": "CAR Conference registration will be located in Salon EF on the lobby level of the Newport Beach Marriott.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "08:00",
        "time_end": "17:00",
        "length_in_hours": 9.0,
        "room": "Salon EF",
        "event_id": "3433/4381",
        "event_url": "https://ire.org/events-and-training/event/3433/4381/"
    },
    {
        "title": "CAR Conference sales (Friday)",
        "type": "Special Event",
        "description": "Stop by the CAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the T-shirt contest.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "08:00",
        "time_end": "17:00",
        "length_in_hours": 9.0,
        "room": "Salon EF",
        "event_id": "3433/4382",
        "event_url": "https://ire.org/events-and-training/event/3433/4382/"
    },
    {
        "title": "Connecting the dots with health data: The Implant Files case",
        "type": "Commons",
        "description": "The Implant Files investigation involved a global effort of more than 1,500 FOI requests to gather data on medical devices in different parts of the world. It was a collaboration that involved more than 250 journalists in 36 countries. As a result, ICIJ released the first International Medical Devices Database that facilitates the exploration of more than 75,000 recalls, safety alerts and field safety notices of medical devices and their connections with manufacturers.\n\nJoin us to explore the possibilities this data collection has to offer and how to connect it with other health datasets to report on stories linked to the medical devices industry.",
        "speakers": "Emilia Diaz-Struck of The International Consortium of Investigative Journalists; Margot Williams of The Intercept; Karrie Kehoe of ICIJ-Ctr for Public Integrity; Andrew Lehren of NBC News; Emily Siegel of NBC News",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4367",
        "event_url": "https://ire.org/events-and-training/event/3433/4367/"
    },
    {
        "title": "Cops, docs, and traffic stops: Criminal justice reporting through data",
        "type": "Panel",
        "description": "This panel explores the pathways of finding, capturing and using data to tell compelling and relevant criminal justice stories. The group will also share techniques for breaking through the thin blue line of secrecy, and how to avoid common pitfalls along the way.",
        "speakers": "Anita Hassan of Las Vegas Review-Journal; Ben Poston of Los Angeles Times; Alysia Santo of The Marshall Project; Alain Stephens of inewsource",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4186",
        "event_url": "https://ire.org/events-and-training/event/3433/4186/"
    },
    {
        "title": "Excel: Advanced pivot tables",
        "type": "Hands-on",
        "description": "You've done a few pivot tables and are getting curious what more you could do with them. What happens if you aggregate by more than one column? What are those \"column\" and \"filter\" boxes for? Come unlock the full potential of pivot tables in this intermediate spreadsheet class.\n\nThis session is good for: People familiar with spreadsheets and aggregating data with pivot tables, or anyone who has taken Excel 1-3.",
        "speakers": "Kimbriell Kelly of The Washington Post",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4253",
        "event_url": "https://ire.org/events-and-training/event/3433/4253/"
    },
    {
        "title": "How it works: Artificial intelligence",
        "type": "Panel",
        "description": "Artificial intelligence is the hottest new frontier in computing — but what is AI, really? This session introduces you to the basics of AI, demystifying the fundamentals so you can understand what's real and what's still science fiction.\n\nWe'll talk about the reasons you don't have to be afraid of killer robots, but you should worry about facial recognition and the ways that AI systems reinforce inequality. After the basics, we'll look at how AI can be used for investigative reporting. We'll answer questions like: how can you get started with AI for reporting? What can AI do for you in the newsroom, and what can't it do? What claims about AI should trigger your journalistic skepticism?\n\nThis session is designed for people who have unanswered questions about AI, journalists who are curious about AI in the newsroom, and anyone who has wondered exactly why machine learning is such a big deal.",
        "speakers": "Meredith Broussard of New York University",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4203",
        "event_url": "https://ire.org/events-and-training/event/3433/4203/"
    },
    {
        "title": "Intro to OpenRefine",
        "type": "Demo",
        "description": "OpenRefine is a free, open-source tool for working with messy data. This session will provide a comprehensive overview of OpenRefine features. We will showcase how you can use OpenRefine to\n\nA lab session is scheduled separately for those interested in a hands-on experience.",
        "speakers": "Martin Magdinier of OpenRefine Foundation",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4307",
        "event_url": "https://ire.org/events-and-training/event/3433/4307/"
    },
    {
        "title": "JavaScript 1: Fundamentals and syntax",
        "type": "Hands-on",
        "description": "Functions, \" for loops\" and objects: They can be confusing at first, but once you master these and other JavaScript coding conventions, you'll be able to build fancy data visualizations and more. In this class, you will learn the basic fundamentals and syntax of the JavaScript programming language. No coding experience is necessary.\n\nThis session is good for: Beginners who want to start building things for the web.",
        "speakers": "Allison McCartney of Bloomberg News",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4263",
        "event_url": "https://ire.org/events-and-training/event/3433/4263/"
    },
    {
        "title": "R: Models for clustered and correlated data",
        "type": "Hands-on",
        "description": "Basic linear regression is great, but what happens when not all of your observations are independent or you have multiple observations per subject? Take your statistical analysis skills to the next level when you learn how to measure the relationships within correlated and clustered data in R using the gee package.\n\nThis session is good for: Intermediate R users who are comfortable with linear and logistic regression and want to learn more complex modeling methods.",
        "speakers": "Mary Ryan of University of California - Irvine",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4141",
        "event_url": "https://ire.org/events-and-training/event/3433/4141/"
    },
    {
        "title": "Stats 1: An introduction using PSPP",
        "type": "Hands-on",
        "description": "Statisticians need to really understand their data (and so do you!) before they begin running analyses. As a result, statistical software packages such as PSPP and SPSS have many powerful tools to summarize your data. You're going to love them. We'll take a look at the structure of data in PSPP, do data transformations and run some basic statistical tests.\n\nThis session is good for: People who have familiarity with Excel and some database software. We've got a *lot* of ground to cover in this hour.",
        "speakers": "Holly Hacker of The Dallas Morning News",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4228",
        "event_url": "https://ire.org/events-and-training/event/3433/4228/"
    },
    {
        "title": "The data sleuth's guide to the social web",
        "type": "Demo",
        "description": "Whether you're spotting bots by plotting their activity levels or you're analyzing the spread of hate speech or misinformation in quantitative ways — there are many ways for journalists to investigate stories on the social web.\n\nThis demo will walk through various approaches to leverage social media data for different kinds of stories and talk about the kinds of tools needed to report them out.",
        "speakers": "Jane Lytvynenko of BuzzFeed News; Lam Thuy Vo of BuzzFeed News",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4147",
        "event_url": "https://ire.org/events-and-training/event/3433/4147/"
    },
    {
        "title": "The election and politics data you're not using",
        "type": "Demo",
        "description": "Beyond readily available campaign finance and elections results, there's a wealth of other election and political data that can produce stories throughout the election cycle. We'll take a closer look at congressional disclosures, election administration, Foreign Agent Registration Act (FARA) and others.",
        "speakers": "Sarah Bryner of Center for Responsive Politics; Michelle Ye Hee Lee of The Washington Post; Derek Willis of ProPublica",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4298",
        "event_url": "https://ire.org/events-and-training/event/3433/4298/"
    },
    {
        "title": "Interviewing your data with SQL (cont'd Friday) **pre-registered attendees only",
        "type": "Hands-on",
        "description": "his is a continuation of Interviewing your data with SQL from Thursday, March 7 for pre-registered attendees of this class.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon 4",
        "event_id": "3433/4134",
        "event_url": "https://ire.org/events-and-training/event/3433/4134/"
    },
    {
        "title": "Master class: Telling the data story across platforms **pre-registered attendees only",
        "type": "Workshop",
        "description": "No matter your media type, a successful data story or investigation requires the ability to connect with audiences on several platforms, including broadcast, digital and social media. But with limited time and resources, it can be challenging to develop and execute a plan that cuts across media.\n\nWe’ll cover:\n\nThis session is good for reporters, editors and producers. We’ll talk about the roles each person plays in this process, and provide tips to take back to your team. Please come with a story you’re investigating to workshop as well as your laptop.\n\nPreregistration is required and seating is limited.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Josh Hinkle of KXAN/NBC Austin; Lisa Pickoff-White of KQED Public Radio",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4130",
        "event_url": "https://ire.org/events-and-training/event/3433/4130/"
    },
    {
        "title": "Mastering Google Sheets: Web scraping, running scripts and other tricks **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Beginner\n\nGoogle Sheets is more than just free spreadsheet software to organize and store data. In this hands-on session will start with pivot tables and conditional formatting but through examples, we'll also learn how to scrape data in seconds without code, automate menial tasks with macros, write custom spreadsheet formulas as well as how to send emails, geocode addresses, translate text and more – all through the power of Google Sheets. Come with a laptop and leave with the knowledge of a Google Sheets power user.\n\nPreregistration is required and seating is limited. Attendees must bring a laptop and charger (no tablets) to this training.\n\nWorkshop prerequisites: You should be familiar with using spreadsheets and formulas.",
        "speakers": "Frank Bi of Vox Media",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4110",
        "event_url": "https://ire.org/events-and-training/event/3433/4110/"
    },
    {
        "title": "PyCAR (cont'd-Friday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "This is a continuation of PyCAR from Thursday, March 7 for pre-registered attendees of this class.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon 5",
        "event_id": "3433/4097",
        "event_url": "https://ire.org/events-and-training/event/3433/4097/"
    },
    {
        "title": "First Python notebook: Data analysis on deadline *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Beginner/intermediate\n\nBen Welsh, James Gordon and Cheryl Phillips teach data analysis with Python. Their 6-hour, hands-on tutorial will guide you through an investigation of money in politics.\n\nYou will learn:\n\n1) Just enough Python to execute an analysis with the powerful pandas data analysis library, one of the most popular open-source tools for working with large data files.\n\n2) How to record, remix and republish your work using the Jupyter Notebook, a browser-based tool emerging as the standard for reproducible research in the sciences.\n\n3) Most important of all, how these tools increase the speed and veracity of your journalism.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: If you've tried Python once or twice, have good attitude and know how to take a few code crashes in stride, you are qualified for this class.",
        "speakers": "James Gordon of Reynolds Journalism Institute; Ben Welsh of Los Angeles Times; Cheryl Phillips of Stanford University",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4094",
        "event_url": "https://ire.org/events-and-training/event/3433/4094/"
    },
    {
        "title": "MapCamp: QGIS *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nLearn how to uncover interesting news stories by mapping data with geographic information system (GIS) software during our intensive mini-boot camp.\n\nExperienced journalists conduct this hands-on training using the latest version of QGIS, open source-software that runs on all platforms. We will look at noteworthy stories that have used mapping and show you how to uncover stories using census and other data.\n\nYou’ll learn how to display data geographically; import and query data; and geocode to merge databases with addresses into maps. In addition, we'll provide you with our detailed boot camp materials to help keep you on track long after you leave the conference.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: Participants should have basic knowledge in using relational database programs such as Microsoft Access, MySQL or SQLite.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "David Herzog of IRE and NICAR; Jennifer LaFleur of Investigative Reporting Workshop",
        "date": "2019-03-08",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4090",
        "event_url": "https://ire.org/events-and-training/event/3433/4090/"
    },
    {
        "title": "Advanced SQL: Working with dates, sub-queries and more",
        "type": "Hands-on",
        "description": "If you feel comfortable with the Structured Query Language basics that IRE teaches in its boot camps — SELECT, FROM, WHERE, GROUP BY — but are ready to see what else SQL can do, this session is for you. We will cover more advanced ways of manipulating and questioning data, such as date functions, writing sub-queries and other neat tricks. We will use SQLite in the class.\n\nThis session will be most helpful if: You are comfortable with counting and summing in SQL.",
        "speakers": "Jennifer Peebles of The Atlanta Journal-Constitution",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4257",
        "event_url": "https://ire.org/events-and-training/event/3433/4257/"
    },
    {
        "title": "Advocating for diversity and inclusivity in journalism",
        "type": "Panel",
        "description": "When news organizations create a culture built on inclusion and equity, they can better support their staff and provide more representative, impactful journalism to the communities they serve. We'll discuss tactics and strategies for building diverse teams, where decision-making power is transparent and there are clear career and leadership pathways for journalists of color and other marginalized journalists.",
        "speakers": "Cheryl W. Thompson of NPR; Francisco Vara-Orta of IRE and NICAR; Julia B. Chan of Mother Jones",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4148",
        "event_url": "https://ire.org/events-and-training/event/3433/4148/"
    },
    {
        "title": "Favorite code snippets: A responsibly sourced, artisanal list from the Lonely Coder's Club",
        "type": "Commons",
        "description": "The Lonely Coder's Club, a Slack community of newsroom programmers without big teams, would like to present our favorite, most-used code snippets. We've translated these snippets to most common coding languages and commented the heck out them so you can plug and play with ease!\n\nDuring this session, a few Lonely Coders will go through our favorites on the list and how they help save us time on project after project. We’ll also share tips on how you can start writing your own reusable code, no matter how lonely a coder you are.",
        "speakers": "Alexandra Kanik of Louisville Public Media; David Montgomery of CityLab",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4351",
        "event_url": "https://ire.org/events-and-training/event/3433/4351/"
    },
    {
        "title": "Finding the story: Data-driven disaster coverage",
        "type": "Hands-on",
        "description": "Natural disasters such as hurricanes, floods, wildfires and extreme temperature swings are causing historic damage. Together we’ll explore key data sets and learn how to use them to explain catastrophic events to audiences.\n\nThis session is best for people who are already comfortable working with data in spreadsheets and have a basic familiarity with the capabilities of mapping tools such as QGIS or R.",
        "speakers": "Matt Stiles of Los Angeles Times",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4268",
        "event_url": "https://ire.org/events-and-training/event/3433/4268/"
    },
    {
        "title": "How to make your data stories shine for different audiences",
        "type": "Panel",
        "description": "Learn how to turn your data into a compelling story, whether your audience is on their phone or laptop, listening to the radio, watching television or reading the newspaper. We’ll discuss the limits and advantages of different platforms as well as the considerations that go into planning and production for them. We’ll go over tips and tricks for creating data-driven stories that don’t overwhelm your audience with numbers and stats. We’ll review content’s role in driving story presentation decisions, whether you’re developing a custom project or using an out-of-the-box template.",
        "speakers": "Patti DiVincenzo of IRE and NICAR; Dana Amihere of KPCC - 89.3; Youyou Zhou of Quartz",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4194",
        "event_url": "https://ire.org/events-and-training/event/3433/4194/"
    },
    {
        "title": "Interactive visualization for news readers' beliefs: Why and how",
        "type": "Panel",
        "description": "Many data journalists perceive their goal to be presenting data as clearly as possible. But a single data set provides only a partial view on what's true. Readers' prior beliefs about a topic can — and should — influence what they conclude from new data. Visualizations can be used to gather and represent beliefs in ways that transform the reader's experience and your own journalistic design process.\n\nThis talk will introduce you to techniques and theories for helping your readers understand, What do (and should I) believe? We'll demo a new tool that allows anyone to create a \"You draw it\" style visualization to elicit and visualize readers' predictions.",
        "speakers": "Jessica Hullman of Northwestern University; Yea-Seul Kim of University of Washington",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4197",
        "event_url": "https://ire.org/events-and-training/event/3433/4197/"
    },
    {
        "title": "JavaScript 2: Hello D3!",
        "type": "Hands-on",
        "description": "We’ll cover the basics of getting started with D3, even if you’ve never used it before. Then we’ll take several real datasets and use them to create a few basic charts.\n\nThis session is good for: People with a basic grasp of JavaScript syntax who are interested in building data visualizations for the web.",
        "speakers": "Ashlyn Still of Reuters",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4264",
        "event_url": "https://ire.org/events-and-training/event/3433/4264/"
    },
    {
        "title": "Seeing the story: How to write the data-driven investigation",
        "type": "Panel",
        "description": "Learn tactics for writing the data-laden investigation -- from using best cases to illuminate your findings to organizing story elements into a compelling narrative and not a starchy data-dump. We’ll walk through common problems, examples of well-crafted tops and best practices for structuring stories with emotional heft.",
        "speakers": "Brett Murphy of USA TODAY Network; James Neff of The Philadelphia Inquirer; Paula Lavigne of ESPN; Anita Hassan of Las Vegas Review-Journal",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4163",
        "event_url": "https://ire.org/events-and-training/event/3433/4163/"
    },
    {
        "title": "Stats 2: Linear regression using PSPP",
        "type": "Hands-on",
        "description": "Go beyond counting and sorting. Learn how (and when) to measure relationships, level playing fields and make predictions.\n\nThis session is good for: People who took “Stats 1: An introduction” and want to know how to apply what they learned, or are comfortable with summary statistics and PSPP or SPSS and new to stats. Familiarity with spreadsheets and database managers is recommended.",
        "speakers": "Ryan McNeill of Reuters",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4229",
        "event_url": "https://ire.org/events-and-training/event/3433/4229/"
    },
    {
        "title": "The latest digital tools",
        "type": "Demo",
        "description": "Mike Reilley takes you on a deep dive round-up of breakout web tools and resources that promise to challenge conventional reporting processes and level up your journalist toolkit. From the latest data visualization and scraping techniques to sourcing tools, story discovery resources to mobile reporting apps -- this session will leave attendees with a more robust toolbelt and better prepared for sharing stories in 2019.",
        "speakers": "Mike Reilley of Society of Professional Journalists",
        "date": "2019-03-08",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4297",
        "event_url": "https://ire.org/events-and-training/event/3433/4297/"
    },
    {
        "title": "Advanced OpenRefine: Intro to GREL",
        "type": "Hands-on",
        "description": "There is so much more to OpenRefine than the clustering and faceting feature. This session is a deep dive to GREL, OpenRefine expression language (the equivalent of Excel formulas). After a thorough introduction to GREL syntax, we will review the most common functions to explore and clean up your dataset.\n\nFunctions covered in this session include replace, split, concatenate, string comparison, if, cell.cross (to join multiple projects together), and forEach.\n\nThis session is good for: People who are familiar with OpenRefine or with at least some Excel experience. For an introduction to OpenRefine, check out the scheduled demo session.",
        "speakers": "Martin Magdinier of OpenRefine Foundation",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4250",
        "event_url": "https://ire.org/events-and-training/event/3433/4250/"
    },
    {
        "title": "Data blitz",
        "type": "Demo",
        "description": "Like Lightning Talks, but for data. Five presenters will guide you through their favorite datasets.",
        "speakers": "Jeremy Singer-Vine of BuzzFeed News",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4296",
        "event_url": "https://ire.org/events-and-training/event/3433/4296/"
    },
    {
        "title": "Finding untold stories in unfamiliar communities",
        "type": "Panel",
        "description": "Don’t settle for “it can’t be done” or \"I don't have any sources in that culture.\" Although some undercovered communities might seem a mystery, they don't have to remain that way. This session will discuss how to blend diverse voices and sources of data into your stories, and cover hard-to-reach communities, such as those filled with older and more recent immigrants, some who may not have much experience with the media, minority communities who are often fearful of the repercussions of speaking with media, and others.",
        "speakers": "Anh Do of Los Angeles Times; Nausheen Husain of Chicago Tribune; Youyou Zhou of Quartz",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4187",
        "event_url": "https://ire.org/events-and-training/event/3433/4187/"
    },
    {
        "title": "Google Sheets: Scraping without coding (repeat)",
        "type": "Hands-on",
        "description": "Yes, you can scrape data without using code -- in fact, all you need is Google Sheets! We'll be using Excel-type formulas (don't worry if you don't know what those are, either) to make simple scrapers that automatically pull data into Google Sheets. It’s the best way to get around clunky websites and unhelpful PIOs!\n\n**You must have a Google account for this session.\n\nThis session is good for: Beginners who want to start using data for their stories.",
        "speakers": "Samantha Sunne of independent journalist",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 3",
        "event_id": "3433/4237",
        "event_url": "https://ire.org/events-and-training/event/3433/4237/"
    },
    {
        "title": "JavaScript 3: Building a map in D3",
        "type": "Hands-on",
        "description": "Learn how to create an easy D3 map by converting GIS data into nice, reusable TopoJSON, turning it into a map and connecting it to your data. You can then have these maps ready for future use by just switching out a few variables.\n\nThis session is good for: People who have a basic grasp of JavaScript syntax and have been exposed to the D3 library at some point.",
        "speakers": "Emily Merwin DiRico of The Atlanta Journal-Constitution",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4265",
        "event_url": "https://ire.org/events-and-training/event/3433/4265/"
    },
    {
        "title": "Lessons learned from building a database with colleagues",
        "type": "Panel",
        "description": "Building your own database takes some effort. Doing it with a team of other people takes it up a few notches. Panelists will share best practices and some of the nitty-gritty details you need to know before you build your own database, plus the extra things you need to plan for when it’s a group effort.  We’ll talk about software options, how you can have multiple people entering data at the same time, ensuring you end up with standardized data and other details you’ll be glad to know before you start your own project.",
        "speakers": "Dana Amihere of KPCC - 89.3; Todd Wallack of The Boston Globe; MaryJo Webster of Star Tribune",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4169",
        "event_url": "https://ire.org/events-and-training/event/3433/4169/"
    },
    {
        "title": "Shooting straight: How to use gun data and documents effectively",
        "type": "Panel",
        "description": "In this session, we'll show you how to sort out what data and documents you can gather for reporting on guns, where you're wasting your time and when you should build from the ground up. We'll discuss common pitfalls and how to accurately and fairly cover the firearms industry, gun violence and regulatory agencies. We'll also offer tips on reliable data streams, sample data on guns and tips on finding sources.",
        "speakers": "Anthony Cave of KERA News; Polly Mosendz of Bloomberg News; Daniel Nass of The Trace; Cheryl W. Thompson of NPR",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4175",
        "event_url": "https://ire.org/events-and-training/event/3433/4175/"
    },
    {
        "title": "Stats 3: Logistic regression using PSPP",
        "type": "Hands-on",
        "description": "Linear regression helps you find relationships between two or more variables, but when an outcome has only two possibilities, you need a different tool. That, my friends, is where logistic regression comes in.\n\nThis session will be taught in PSPP and is good for people who took “Stats: An introduction” or are comfortable with summary statistics and PSPP or SPSS. Familiarity with spreadsheets and database managers is recommended.",
        "speakers": "John Perry of The Atlanta Journal-Constitution",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4230",
        "event_url": "https://ire.org/events-and-training/event/3433/4230/"
    },
    {
        "title": "Using public records laws to get data",
        "type": "Panel",
        "description": "A how-to on crafting the best-worded FOIA and state public records queries along with tips on how to actually get the documents you need for compelling investigations.",
        "speakers": "Christopher Baxter of NJ Advance Media; Norberto Santana of Voice of OC; Katie Townsend of Reporters Committee for Freedom of the Press",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4151",
        "event_url": "https://ire.org/events-and-training/event/3433/4151/"
    },
    {
        "title": "Women in journalism meetup",
        "type": "Commons",
        "description": "This session will be an off-the-record discussion about being a woman in journalism. Some topics we'll bring up will include: negotiating your pay and the pay gap, balancing family and work, challenges and advice on climbing the ladder, dealing with sexist accusations about your reporting and pushing back when you know you have a good story.",
        "speakers": "Jenifer McKim of New England Center for Investigative Reporting; Nicole Vap of KUSA/9News Denver; Kavya Sukumar of Hearken",
        "date": "2019-03-08",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4358",
        "event_url": "https://ire.org/events-and-training/event/3433/4358/"
    },
    {
        "title": "Media lawyers brown bag",
        "type": "Special Event",
        "description": "**Moderated by Maggie Mulvihill, Boston University\n\nDuring the media lawyers brown bag, between 12:45 and 1:45 p.m. on Friday, March 8, bring your lunch and your questions for a personal discussion with a panel of media lawyers and FOIA-savvy speakers. IRE & NICAR will provide drinks and dessert.",
        "speakers": "Maggie Mulvihill of Boston University; Katie Townsend of Reporters Committee for Freedom of the Press; Tina Salvato of Sheppard Mullin Richter & Hampton LLP; Matthew Halgren of Sheppard Mullin Richter & Hampton LLP; Adam Marshall of Reporters Committee for Freedom of the Press",
        "date": "2019-03-08",
        "time_start": "12:45",
        "time_end": "13:45",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4353",
        "event_url": "https://ire.org/events-and-training/event/3433/4353/"
    },
    {
        "title": "CAR throwback",
        "type": "Demo",
        "description": "This year, we’re going way, way back. We’ll take you on a ride on the Information Superhighway 1990s style. We’ll tell you about the tools we used to work with records on a computer! Expect classic NICAR datasets, dated references and more lame jokes. Along with the history lesson, we will provide some of the same data tips that are vital to data journalism.",
        "speakers": "Jennifer LaFleur of Investigative Reporting Workshop; Cheryl Phillips of Stanford University; Aron Pilhofer of Temple University",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon C&D",
        "event_id": "3433/4302",
        "event_url": "https://ire.org/events-and-training/event/3433/4302/"
    },
    {
        "title": "Covering immigration with data",
        "type": "Panel",
        "description": "Migration will continue to be one of the most important issues reporters will need to cover responsibly -- this session will provide a rundown of data available on all the aspects of migration: immigration, asylum-seekers, refugees and refugee camps, detained families and children, etc., the stories that have come out of that data, and the potential stories that could come out of that data.",
        "speakers": "Nausheen Husain of Chicago Tribune; Christine Mehta of Syracuse University, Newhouse School; Ryan McNeill of Reuters",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4153",
        "event_url": "https://ire.org/events-and-training/event/3433/4153/"
    },
    {
        "title": "Finding the story: Using DNS search for investigative journalism",
        "type": "Hands-on",
        "description": "Learn how to use DNSDB Scout, a tool to query DNSDB, a historical passive Domain Name System (DNS) database, to discover previously unknown online connections and gain new information to advance your investigations. DNSDB Scout is available for both Google Chrome and Mozilla Firefox.\n\nDr. Paul Vixie, an internet pioneer who was inducted into the Internet Hall of Fame in 2014 for his work related to DNS, will provide a brief DNS primer before providing the journalists a hands-on opportunity, using DNSDB, to examine the online footprint of a well-known political network to uncover dozens of its affiliated organizations.\n\n**You must bring a laptop with Firefox and Google Chrome installed for this workshop. Logins will be provided to use DNSDB.\n\nBasic knowledge of the Domain Name System (DNS) is helpful, but not required.",
        "speakers": "Paul Vixie of Farsight Security",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4220",
        "event_url": "https://ire.org/events-and-training/event/3433/4220/"
    },
    {
        "title": "Freelancers' roundtable",
        "type": "Commons",
        "description": "A freelancer has to juggle more than the average reporter - long lead time, high expectations, a wide variety of tasks and deadlines (or sometimes worse, no deadlines). Join the conversation and discuss how to know when you have a good enough story to pitch? How deep do you dive before you know you're getting paid? How do you build sources without a household name? A few freelance investigative reporters with experience in these areas will share their own tips and take questions from the audience - past, current and prospective freelancers welcome.",
        "speakers": "Sandra Fish of independent journalist; Samantha Sunne of independent journalist; Allison McCartney of Bloomberg News",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4360",
        "event_url": "https://ire.org/events-and-training/event/3433/4360/"
    },
    {
        "title": "Making graphics and maps with R",
        "type": "Hands-on",
        "description": "Learn how to visualize data in R with this introductory graphics class. From scatter plots to bar charts to box plots, we'll cover the basics of what you need to get an idea of what your data is telling you using ggplot2 and base R. We will also cover labeling, faceting, legends, and some cosmetics (changing colors and line/dot patterns, and displaying multiple plots in one window).\n\nThis session is good for: R beginners who want to know how to visualize data.",
        "speakers": "Mary Ryan of University of California - Irvine",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4206",
        "event_url": "https://ire.org/events-and-training/event/3433/4206/"
    },
    {
        "title": "MySQL",
        "type": "Hands-on",
        "description": "Data often comes in large or relational tables that require a good database manager beyond what Excel can offer. MySQL is a free powerful and popular open-source tool and with it, you can transform and analyze almost any data set. In this class, we will introduce you to MySQL and how it works.\n\nThis session is good for: People with some experience working with data in columns and rows and who are familiar with SQL.",
        "speakers": "Jack Gillum of ProPublica",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4259",
        "event_url": "https://ire.org/events-and-training/event/3433/4259/"
    },
    {
        "title": "PDF 1: Using free online tools (repeat)",
        "type": "Hands-on",
        "description": "This class will cover basic approaches for getting text out of PDF documents using powerful and freely available tools. Participants will be introduced to basic concepts and walked through tackling common challenges encountered with tricky PDF documents.\n\nThis session is good for: People who are unfamiliar with PDF-to-text tools or would like to learn how these tools can be used for extracting difficult text from images embedded in a PDF document.",
        "speakers": "Caitlin Ostroff of McClatchy",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4225",
        "event_url": "https://ire.org/events-and-training/event/3433/4225/"
    },
    {
        "title": "Python: Let's scrape a website",
        "type": "Hands-on",
        "description": "This hands-on training will illustrate how Python can be used to grab a lot of data from a website at once, whether by pulling content from a page or interacting with forms. You’ll want to be comfortable writing loops in Python, though you won’t necessarily need to be able to write a function from scratch!\n\nThis session is good for people who feel comfortable with Python’s data types and control flow (if/else, loops). Experience with HTML is a plus but not necessary. Note: It would be useful to attend the session \" How it Works: The Internet\" in advance if you’re not familiar with the topic already.",
        "speakers": "Ryan Pitts of OpenNews",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4246",
        "event_url": "https://ire.org/events-and-training/event/3433/4246/"
    },
    {
        "title": "This just in ... you can plan for breaking news",
        "type": "Panel",
        "description": "News breaks and journalists & editors scramble to react. Afterward shoulders are shrugged and we say \"Forget it, Jake. It's breaking news.\" That's not how it needs to work. What if instead we could approach breaking news situations with a sense of calm and confidence? What if we considered the who, what, where, why and how of things that could happen, and simply left the when to chance?Let's have a discussion and develop a plan for covering the news that could/will happen in our market.",
        "speakers": "Rick Hirsch of Miami Herald; Chris Keller of Los Angeles Times; Nicole Vap of KUSA/9News Denver",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4200",
        "event_url": "https://ire.org/events-and-training/event/3433/4200/"
    },
    {
        "title": "When the data talks (but the people won't)",
        "type": "Panel",
        "description": "Strategies for analyzing data that sources won't explain. How to get around roadblocks and convince people to talk to you.",
        "speakers": "Cary Aspinwall of The Dallas Morning News; Robert Benincasa of NPR; Sarah Rafique of KXAN/NBC Austin",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4202",
        "event_url": "https://ire.org/events-and-training/event/3433/4202/"
    },
    {
        "title": "Digging into data for stories: A crash course in Excel - *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Beginner\n\nGet started with using data in your stories with IRE's original mini-boot camp. In this 9-hour, hands-on workshop, IRE’s experienced trainers will start with the basics of navigating Excel and using formulas, then walk you through sorting, filtering and aggregating data with PivotTables to find story ideas.\n\nYou'll come away with a solid base for using data analysis in your newsroom, including how to find and request data, identify and clean dirty data, find story ideas and bulletproof your work.\n\nWe’ll also provide you with our detailed boot camp materials to help keep you on track long after you leave the conference.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: There are no prerequisites for this workshop and beginners are welcome. This workshop is good for those wanting to get started analyzing data for stories.\n\nWorkshop times are Friday, March 8, 2:15 p.m. - 5:45 p.m.; Saturday, March 9, 2:15 p.m. - 5:45 p.m.; Sunday, March 10, 9:00 a.m. - 12:30 p.m. (Registration for this session reserves your seat for all days of this workshop and attendees are expected to attend all sessions to complete the workshop.)\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Sarah Hutchins of IRE and NICAR; Denise Malan of IRE and NICAR; Charles Minshew of IRE and NICAR; Cody Winchester of IRE and NICAR",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 4",
        "event_id": "3433/4089",
        "event_url": "https://ire.org/events-and-training/event/3433/4089/"
    },
    {
        "title": "Intro to R (Friday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nCharles Minshew, IRE/NICAR will introduce you to R, a free, powerful open-source programming language, that will add statistical heft to your reporting. By the end of this three-hour session, you will be able to take raw data, import it into R, and start your analysis. Topics will include basic data importing, working with directories, reading in data, installing packages, creating simple visualizations, and how to clean, explore and sort your data. We'll also talk about how to find help when you're stuck.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: This session will be most helpful if you’re comfortable working with data and you’re ready to take your skills to the next level.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Charles Minshew of IRE and NICAR",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 3",
        "event_id": "3433/4394",
        "event_url": "https://ire.org/events-and-training/event/3433/4394/"
    },
    {
        "title": "Master class: Design thinking for journalists **pre-registered attendees only",
        "type": "Workshop",
        "description": "Skill level: Beginner\n\nSpeakers: Angelica McKinley and Lena Groeger.\n\nAnyone can improve the design and usability of a journalistic project (from a basic story page to an interactive graphic) with a few simple fixes. Even if you have zero experience in design and concepts like \" alignment\" and \"responsiveness\" seem like technical jargon, this session is for you. We'll go through our favorite design rules of thumb, covering everything from typography to interaction to accessibility, and apply them to real-life examples in the news and beyond.\n\nWe’ll also cover:\n\nBy the end of this workshop, you'll be able to recognize poor designs and identify how to fix them, and you’ll be on your way to creating your own designs with better organization, unity and clarity.\n\nPreregistration is required and seating is limited.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Lena Groeger of ProPublica; Angelica McKinley of independent journalist",
        "date": "2019-03-08",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4131",
        "event_url": "https://ire.org/events-and-training/event/3433/4131/"
    },
    {
        "title": "25th CAR: What a ride it's been!",
        "type": "Panel",
        "description": "Buckle up for a fast-paced ride through 25 years of data journalism, told through the people who drove CAR into the mainstream of investigative reporting. You’ll hear about pivotal moments, bizarre twists and befuddled bureaucrats who didn’t know what hit them. Featuring special guests! Expected guest speakers include Crina Boros, Center for Investigative Journalism; Sarah Cohen, ASU Walter Cronkite School of Journalism; Steve Doig, ASU Walter Cronkite School of Journalism; Jaimi Dowdell, Reuters; Mark Horvit, University of Missouri; Brant Houston, University of Illinois; Clarence Jones, independent journalist; Jennifer LaFleur, Investigative Reporting Workshop; and James B. Steele, independent journalist.",
        "speakers": "Doug Haddix of IRE and NICAR; Shawn McIntosh of The Atlanta Journal-Constitution",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon C&D",
        "event_id": "3433/4162",
        "event_url": "https://ire.org/events-and-training/event/3433/4162/"
    },
    {
        "title": "Bring your investigative reporting to life using animation and illustrations",
        "type": "Panel",
        "description": "Got court transcripts of a particular riveting moment during a trial? Need readers to understand a wonky concept that’s hard to explain in writing? This panel will show you new ways animation and illustrations can bring important moments of your investigation that happened behind closed doors or inside a computer to life.\n\nYou will learn how investigative journalists and animators have used illustrations of courtrooms, nursing homes, and prison cells to “re-create” and animate crucial moments in an investigation that no one had access to. We will share how animation works and what best practices producers have developed in their newsrooms, whether or not they had access to fancy software. We will also tackle ethical pitfalls that investigative journalists have faced using animations and cover how to get started producing your own explainer video a la Vox.",
        "speakers": "Ranjani Chakraborty of Vox Media; Blake Nelson of NJ Advance Media; Hilke Schellmann of The Wall Street Journal",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4184",
        "event_url": "https://ire.org/events-and-training/event/3433/4184/"
    },
    {
        "title": "Data visualization and storytelling with Flourish",
        "type": "Hands-on",
        "description": "Learn how to use Flourish, a free, online tool to build custom visualizations from your spreadsheets, no coding required. Flourish grew out of Kiln, the award-winning data studio that has helped dozens of organizations to visualize and tell stories with data.\n\n**You must bring a laptop and sign up for a free account at flourish.studio to participate in this class.\n\nThis session is good for: Anyone familiar with spreadsheets. No visualization experience required.",
        "speakers": "Marco Tulio Pires of Google",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4354",
        "event_url": "https://ire.org/events-and-training/event/3433/4354/"
    },
    {
        "title": "Excel CARwash: Cleaning dirty data",
        "type": "Hands-on",
        "description": "Dirty data lurk everywhere: in text files, spreadsheets, databases and PDFs. We'll walk you through some examples of the most common types of dirty data, point out telltale signs of data illness and explain how you can whip data into shape using some simple tools and methods.\n\nThis session is good for: People with some experience working with data in columns and rows, in spreadsheets or database managers.",
        "speakers": "Jennifer Smith Richards of Chicago Tribune",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4261",
        "event_url": "https://ire.org/events-and-training/event/3433/4261/"
    },
    {
        "title": "Free, easy data viz",
        "type": "Demo",
        "description": "Got a data project you want to make shine, but you're short on time, money and help? We'll demonstrate several free tools both online and on your computer so you can make interactive maps, graphs, timelines, and even simple animations. No previous experience needed -- and these tools work great for social media, online, print, and television.",
        "speakers": "Jamie Grey of InvestigateTV",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4142",
        "event_url": "https://ire.org/events-and-training/event/3433/4142/"
    },
    {
        "title": "How to follow the dark money in politics",
        "type": "Demo",
        "description": "Nearly $1 billion has been spent by dark money groups since the U.S. Supreme Court's Citizens United decision in 2010. These opaque organizations generally aren't required to disclose their donors, but obscure public records can help you shine a light on their activities and their funders. OpenSecrets.org and MapLight.org have numerous resources available for reporters interested in following the dark money in politics, and Issue One recently published a database of nearly 1,200 transactions detailing contributions from more than 400 unique donors to the leading dark money groups — a database that is searchable online (bit.ly/DarkMoneyData) and on ProPublica's FEC Itemizer tool.\n\nAs the 2020 election cycle ramps up, come learn tips from some of the top dark money sleuths in the country for scouring filings with the Federal Election Commission, Internal Revenue Service, Department of Labor, Congress, corporate websites and other sources.",
        "speakers": "Michael Beckel of Issue One; Anna Massoglia of Center for Responsive Politics; Andrew Perez of MapLight",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4295",
        "event_url": "https://ire.org/events-and-training/event/3433/4295/"
    },
    {
        "title": "How to verify that emails are authentic with DKIM and ARC",
        "type": "Hands-on",
        "description": "Suppose someone leaks you an email -- maybe it's an email they received from a public official that's noteworthy. Maybe it's from a hacker. How do you make sure it's not a fake? In this hands-on session, we'll guide you through that process. How do you get what you need from the source? What the heck is a DKIM header? How do you interpret the results of the verification process? What hiccups might you run into?\n\nSome basic familiarity with the command line will be helpful, but no coding knowledge or experience necessary.",
        "speakers": "Jeremy Merrill of Quartz",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4145",
        "event_url": "https://ire.org/events-and-training/event/3433/4145/"
    },
    {
        "title": "Mapping with R",
        "type": "Hands-on",
        "description": "Learn how to create beautiful static or interactive maps and conduct geospatial analyses all within R. We'll map with sf and leaflet packages. We'll write scripts to pull data and shapefiles through packages that utilize APIs from the Census. We'll transform and analyze data and turn your exploratory map viz into maps nearly pretty enough to publish.\n\nThis session is good for: People who already have some familiarity with R, mapping, Census data, and using ggplot2.",
        "speakers": "Andrew Tran of The Washington Post",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4207",
        "event_url": "https://ire.org/events-and-training/event/3433/4207/"
    },
    {
        "title": "PDF 2: Using OCR to extract data from PDFs",
        "type": "Hands-on",
        "description": "This class will cover basic approaches for getting text out of PDF documents using powerful and freely available tools. Participants will be introduced to basic concepts and walk through tackling common challenges encountered with tricky PDF documents.\n\nThis session is good for: People who are unfamiliar with the PDF-to-text tools or would like to learn how optical character recognition (OCR) tools can be used for extracting difficult text from images embedded in PDF document.",
        "speakers": "Chad Day of The Associated Press",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4226",
        "event_url": "https://ire.org/events-and-training/event/3433/4226/"
    },
    {
        "title": "To manage or not: Choosing the right career path",
        "type": "Commons",
        "description": "Career growth is often equated with becoming a people manager. But what if people management is not your strength? Can it be learned? Let's talk about how to decide what is right for you, discuss career growth options that don't involve managing people and share tips, tricks and resources.",
        "speakers": "Soo Oh of The Wall Street Journal; Kavya Sukumar of Hearken",
        "date": "2019-03-08",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4342",
        "event_url": "https://ire.org/events-and-training/event/3433/4342/"
    },
    {
        "title": "ArcGIS Online: Connect the where and the why with interactive demographic maps",
        "type": "Hands-on",
        "description": "Demographic information can add critical context to any story. When paired with location, it can help explain why things happen where they do. Join us for a hands-on session where we’ll explore visualization- and analysis-ready datasets available to use in your stories. We’ll show you how to quickly find authoritative content in ArcGIS Online, run powerful spatial analyses, and create responsive web apps to support your reporting.\n\nYou will get hands-on experience with the browser-based ArcGIS Online. Anyone who attends this session will also receive complimentary access to ArcGIS Pro, ArcGIS Online, and ArcGIS Maps for Office so you can continue your visualization journey long after you leave the conference.\n\nThis session is good for: Anyone who’s wanted to dig into demographics but wasn’t sure where or how to start and those interesting in telling visual stories with that data.",
        "speakers": "Robby Deming of Esri; Chris Vaillancourt of Esri",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4224",
        "event_url": "https://ire.org/events-and-training/event/3433/4224/"
    },
    {
        "title": "Building your own database (repeat)",
        "type": "Hands-on",
        "description": "In this hands-on session, we'll turn some paper records into machine-readable data. Along the way, we'll learn the best practices of structuring a data set and entering data, and we'll talk about pitfalls such as data types, unstandardized data and memo fields.\n\n**You must bring a laptop and have a Google account to participate in this session.\n\nThis session is good for: Anyone familiar with the basics of spreadsheets and frustrated by paper records.",
        "speakers": "Matt Carroll of Northeastern University",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4277",
        "event_url": "https://ire.org/events-and-training/event/3433/4277/"
    },
    {
        "title": "Career roundtable",
        "type": "Panel",
        "description": "Looking for advice on how to take the next step in your career? Get practical tips from panelists who will talk about their own experiences and discuss what employers are looking for.",
        "speakers": "Lee Zurik of WVUE-New Orleans; Alden Loury of WBEZ  Public Radio; Soo Oh of The Wall Street Journal; Coburn Dukehart of Wisconsin Center for Investigative Journalism",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4196",
        "event_url": "https://ire.org/events-and-training/event/3433/4196/"
    },
    {
        "title": "PDF 3: Batch pdf processing",
        "type": "Hands-on",
        "description": "This class will cover advanced tools for working with PDF, particularly the Python library pdfplumber. Learn how you can use programming skills to unlock information from PDF files that tools like Tabula or CometDocs just won't deal with.\n\nThis session is good for: People who are familiar with Python notebooks, or if you've taken the first two PDF classes in the track.",
        "speakers": "Daniel Nguyen of independent journalist",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4227",
        "event_url": "https://ire.org/events-and-training/event/3433/4227/"
    },
    {
        "title": "Publish the data behind your stories with SQLite and Datasette",
        "type": "Hands-on",
        "description": "Datasette is a tool for exploring and publishing data. It can be used on a laptop to analyze data, then publish that data to the web as an interactive website and accompanying JSON API.\n\nDatasette is part of an ecosystem of tools built on top of SQLite, a fast and flexible open-source database engine. Data that starts life as CSV, JSON or other formats can be converted to SQLite, joined against other data, analyzed, visualized and then published online.\n\nThis workshop will cover:\n\nThis session is good for: those with some familiarity with SQL.",
        "speakers": "Simon Willison of Datasette",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4294",
        "event_url": "https://ire.org/events-and-training/event/3433/4294/"
    },
    {
        "title": "R: Intro stats (repeat)",
        "type": "Hands-on",
        "description": "Learn how to use R to spot trends and identify relationships in data using social science theories and methods. In this session, we will use R for statistical significance tests, cross-tabulations and linear regression.\n\nThis session is good for: Anyone who is comfortable working with spreadsheets and database managers and wants to learn how to do basic statistical analysis. Some experience with R will be helpful.",
        "speakers": "Steve Reilly of USA TODAY Network",
        "date": "2019-03-08",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4291",
        "event_url": "https://ire.org/events-and-training/event/3433/4291/"
    },
    {
        "title": "Lightning Talks",
        "type": "Panel",
        "description": "Sometimes you don't need 45 minutes to explain a useful technique or interesting resource. Join your colleagues for a session of short (5-minute) talks. Here's the 2019 lineup:\n\n1. How to write a data story in five minutes — Youyou Zhou\n\n2. 5 ways to write racist code (with examples) —Alex Garcia\n\n3. How to build a massive database that no one wants you to build — Disha Raychaudhuri\n\n4. FOIA is my API — Matt Kiefer\n\n5. 911, What’s Your Emergency: how insider knowledge of law enforcement has been an asset — Stacy Montemayor\n\n6. How To Use Your Data Skills To Gain Financial Independence — Sean McMinn\n\n7. My own worst enemy: Overcoming impostor syndrome* — Kate Martin\n\n8. How to beat a serious case of the post-project blues — Christopher Baxter\n\n9. Blindspotting: Covering communities you’re not a part of — Emmanuel Martinez\n\n10. Save Student Newsrooms. How you can help the next generation of journalists — Caitlin Ostroff\n\nLightning Talks is sponsored by the Knight Foundation.",
        "speakers": "Sandhya Kambhampati of ProPublica Illinois",
        "date": "2019-03-08",
        "time_start": "17:00",
        "time_end": "18:15",
        "length_in_hours": 1.25,
        "room": "Grand Pacific A-D",
        "event_id": "3433/4374",
        "event_url": "https://ire.org/events-and-training/event/3433/4374/"
    },
    {
        "title": "Philip Meyer Award Presentation",
        "type": "Special Event",
        "description": "The presentation of the 2018 Philip Meyer Journalism Awards will take place on Friday at the 2019 CAR Conference in Newport Beach. The awards recognize the best uses of social research methods in journalism and are named in honor of Philip Meyer, author of “Precision Journalism” and retired Knight Chair in Journalism and UNC School of Journalism and Mass Communications.\n\nThree awards are given annually — a first, second and third place — to recognize the best work using techniques that are part of precision journalism, computer-assisted reporting and social science research. The awards are: $500 for first, $300 for second, and $200 for third.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "18:15",
        "time_end": "18:30",
        "length_in_hours": 0.25,
        "room": "Grand Pacific A-D",
        "event_id": "3433/4375",
        "event_url": "https://ire.org/events-and-training/event/3433/4375/"
    },
    {
        "title": "Philip Meyer Journalism Awards Reception (Co-sponsored by Reporters Committee for Freedom of the Press and IRE)",
        "type": "Reception",
        "description": "Join fellow CAR attendees and award winners at a reception with light appetizers and a cash bar immediately following the awards presentation beginning at 6:30 p.m.",
        "speakers": null,
        "date": "2019-03-08",
        "time_start": "18:30",
        "time_end": "19:30",
        "length_in_hours": 1.0,
        "room": "Rose Garden & Pool",
        "event_id": "3433/4376",
        "event_url": "https://ire.org/events-and-training/event/3433/4376/"
    },
    {
        "title": "CAR Conference registration (Saturday)",
        "type": "Special Event",
        "description": "CAR Conference registration will be located in Salon EF on the lobby level of the Newport Beach Marriott.",
        "speakers": null,
        "date": "2019-03-09",
        "time_start": "08:30",
        "time_end": "18:00",
        "length_in_hours": 9.5,
        "room": "Salon EF",
        "event_id": "3433/4383",
        "event_url": "https://ire.org/events-and-training/event/3433/4383/"
    },
    {
        "title": "CAR Conference sales (Saturday)",
        "type": "Special Event",
        "description": "Stop by the CAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the T-shirt contest.",
        "speakers": null,
        "date": "2019-03-09",
        "time_start": "08:30",
        "time_end": "18:00",
        "length_in_hours": 9.5,
        "room": "Salon EF",
        "event_id": "3433/4384",
        "event_url": "https://ire.org/events-and-training/event/3433/4384/"
    },
    {
        "title": "Analyzing birth and death data: The wonders of CDC WONDER",
        "type": "Demo",
        "description": "From birth to death: CDC WONDER is indispensable if you're analyzing local, regional or national rates for cancer. Or suicide. Or premature birth. Or pedestrian traffic fatalities. Or fatal drug overdoses. It's a powerful front end to query tens of millions of birth and death certificates; the national cancer registry; and more.  Bonus: A gentle introduction to age-adjusted rates. Bring your laptop to follow along.",
        "speakers": "Paul Overberg of The Wall Street Journal",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4311",
        "event_url": "https://ire.org/events-and-training/event/3433/4311/"
    },
    {
        "title": "Building and telling a bulletproof data story",
        "type": "Panel",
        "description": "Whether you’re the lone data-cruncher in your organization or the manager of a big-time newsroom, we’re going to share techniques everyone can use to ensure they’ve got bulletproof data. We will first go over questions everyone should ask to avoid dangerous mistakes and assumptions, and then give tips on how to incorporate that data into a compelling story.",
        "speakers": "Matt Dempsey of Houston Chronicle; Pam Dempsey of The Midwest Center for Investigative Reporting; Andrew Lehren of NBC News",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4183",
        "event_url": "https://ire.org/events-and-training/event/3433/4183/"
    },
    {
        "title": "Command line on Macs",
        "type": "Hands-on",
        "description": "Too often in data journalism we forget about the basics. And it doesn't get as basic as the command line. Even knowing a little will make your job easier. Mother Jones reporter AJ Vicens will run through some simple commands, dive into working with spreadsheets and show you some handy tools he frequently uses at work.\n\nThis session is good for: People who feel intimidated by the command line on their computer, but want to explore the power of command line tools.",
        "speakers": "AJ Vicens of Mother Jones",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4223",
        "event_url": "https://ire.org/events-and-training/event/3433/4223/"
    },
    {
        "title": "D3 in a reactive world",
        "type": "Hands-on",
        "description": "In this session, we’ll introduce you to how we bridge the gap between visualization libraries like D3 and the latest component frameworks in JavaScript. We’ll show you how mixing the two can become a powerful way to build reusable chart components that will shortcut your dev time and extend the impact of your work. Students will get a reusable chart template they can take home.\n\nThis session is good for: people with some background in D3.",
        "speakers": "Jon McClure of POLITICO; Beatrice Jin of POLITICO",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4216",
        "event_url": "https://ire.org/events-and-training/event/3433/4216/"
    },
    {
        "title": "How to make your campaign finance dataset useful year-round",
        "type": "Panel",
        "description": "Campaign finance data contains a wealth of data points about the local political power structure that can be used to monitor relationships, priorities and potential influences at any time of the year — not just during a campaign. Join us for a conversation about how we might meaningfully categorize and analyze political donor data in order to create a year-round backgrounding tool that reveals networks operating behind the scenes. We’ll compare and contrast the potential in this approach at the local, state and federal scale.",
        "speakers": "AmyJo Brown of War Streets Media; Sandra Fish of independent journalist; Anu Narayanswamy of The Washington Post",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4165",
        "event_url": "https://ire.org/events-and-training/event/3433/4165/"
    },
    {
        "title": "Introducing The Public Accountability search project",
        "type": "Commons",
        "description": "The Public Accountability Project is a new site to search hundreds of millions of rows of U.S. transparency data for people, addresses and companies. To date, we've indexed federal and state campaign finance, nonprofit grants and employees, 527s, and some personnel records and voter rolls from states that probably won't sue. We'll be demoing the site, and looking for input on what public data you think should be added next.",
        "speakers": "Jacob Fenton of independent journalist",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4369",
        "event_url": "https://ire.org/events-and-training/event/3433/4369/"
    },
    {
        "title": "Management: Leading the data reporting team",
        "type": "Panel",
        "description": "Managing a data team or data story presents challenges for any editor. This session takes an editor's point of view on the ins and outs of managing data journalism. Topics include helping reporters find focus for their data stories; being skeptical of data and finding potential pitfalls; verifying analyses and bulletproofing data stories and apps; using data to find human sources and characters for stories; and planning the best data workflows for your newsroom.",
        "speakers": "Helena Bengtsson of Sveriges Television; John Kelly of USA TODAY Network; Janet Roberts of Reuters",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4164",
        "event_url": "https://ire.org/events-and-training/event/3433/4164/"
    },
    {
        "title": "Python: Let's scrape a website (repeat)",
        "type": "Hands-on",
        "description": "This hands-on training will illustrate how Python can be used to grab a lot of data from a website at once, whether by pulling content from a page or interacting with forms. You’ll want to be comfortable writing loops in Python, though you won’t necessarily need to be able to write a function from scratch!\n\nThis session is good for people who feel comfortable with Python’s data types and control flow (if/else, loops). Experience with HTML is a plus but not necessary. Note: It would be useful to attend the session \"How it Works: The Internet\" in advance if you’re not familiar with the topic already.",
        "speakers": "Mike Stucka of The Palm Beach Post",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4287",
        "event_url": "https://ire.org/events-and-training/event/3433/4287/"
    },
    {
        "title": "QGIS 1: Mapmaking for beginners",
        "type": "Hands-on",
        "description": "Learn to how to make your own maps using free, open-source software called QGIS. This class will teach you how to get started importing and displaying geographic data. Not all datasets need to be mapped, but some do! We'll go over how to find publicly available data, prepare it for mapping, and join together different datasets.\n\nThis session is good for: beginners looking to learn the basics of visualizing geographic data.",
        "speakers": "Daniel Dunford of BBC News; Clara Guibourg of BBC News",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4217",
        "event_url": "https://ire.org/events-and-training/event/3433/4217/"
    },
    {
        "title": "Research on the beach: Deep diving",
        "type": "Demo",
        "description": "Dive into the latest tools for public records and advanced research, sail on to online privacy tips and alerting services and see what's new on the horizon for personal web caching and archiving.",
        "speakers": "Gary Price of INFOdocket; Margot Williams of The Intercept",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4303",
        "event_url": "https://ire.org/events-and-training/event/3433/4303/"
    },
    {
        "title": "SQL 1: Exploring data (repeat)",
        "type": "Hands-on",
        "description": "Learning to manipulate data is a bit like learning a new language. Actually, it is a language, called structured query language (SQL). This session is an introduction to using SQL to zero in on your data by viewing slices and chunks of it and putting it into a useful order so you can spot the stuff you need to get started toward a story. We'll use SQLite and DB Browser, a free database manager.\n\nThis session is good for: People with some experience working with data in columns and rows, in spreadsheets or database managers.",
        "speakers": "Fedor Zarkhin of The Oregonian/OregonLive",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4292",
        "event_url": "https://ire.org/events-and-training/event/3433/4292/"
    },
    {
        "title": "Master class: Mastering the interview **pre-registered attendees only",
        "type": "Workshop",
        "description": "When it comes to interviewing, some reporters are naturals. ProPublica’s Ken Armstrong isn’t one of them. He’ll share the (many) mistakes he’s made and what he’s learned from them. This workshop will move from getting the interview, to conducting the interview, to capitalizing on the interview when it’s time to write.\n\nTopics will include:\n\nWe will venture, ever so briefly, into the mysterious realm of emotions (open mind, open heart). We’ll challenge some of the conventional wisdom surrounding interviewing (pure hooey, some of it). And we’ll watch outstanding interviewers at work, studying what they do — and, more important, what they don’t do.\n\nPreregistration is required and seating is limited.",
        "speakers": "Ken Armstrong of ProPublica",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4132",
        "event_url": "https://ire.org/events-and-training/event/3433/4132/"
    },
    {
        "title": "Upping your Excel game *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nIf you've found yourself struggling in a spreadsheet, thinking that whatever you were trying to achieve seemed harder than it should've been, then this is the class for you. We’ll learn about various tools and functions in Excel that come in handy when you need to re-structure or otherwise get your data ready for analysis. We'll cover string functions, logical functions, date functions, reshaping data, merging data using lookup functions and perhaps a few other nifty tricks if time allows. This is an intermediate Excel class intended for those who have mastered the basics, such as sorting, filtering, pivot tables and using functions. It is a fast-paced class intended to introduce you to these tools. You'll walk out with practice data and a 20-page tipsheet that covers in detail everything we do in class, plus other great Excel tips.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: You should have prior experience using Excel or Google Sheets, and be comfortable with introductory-level spreadsheet skills, such as sorting, filtering, SUM and AVERAGE functions, calculations such as percentage change or percent of total, and how to use Pivot Tables.",
        "speakers": "MaryJo Webster of Star Tribune",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon 3",
        "event_id": "3433/4088",
        "event_url": "https://ire.org/events-and-training/event/3433/4088/"
    },
    {
        "title": "Write better Python code *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate/advanced\n\nYou’ve written a few Python scripts that get the job done, but the initial euphoria has worn off. Your code is hard to read. Bugs are cropping up. And you can’t always explain your process or results to an editor — or yourself. There must be a better way, but the path forward is not clear.\n\nIf you’ve had that itchy feeling, this three-hour, hands-on workshop is for you. This class will explore Python language features that will help you write readable, reliable and reusable code.\n\nPreregistration is required and seating is limited.*Attendees must bring a laptop and charger to the training.\n\nWorkshop prerequisites: Experience with basic Python language features like variables, data types, conditionals and functions are required.",
        "speakers": "Eric Sagara of Big Local News; Serdar Tumgoren of Stanford University",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4087",
        "event_url": "https://ire.org/events-and-training/event/3433/4087/"
    },
    {
        "title": "Exploring the tidyverse in R *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nLearn how to use the tidyverse, a collection of R packages will help you make your data journalism more efficient, stronger and fun. Learn how to import, clean, analyze and plot data for your stories. If you've used packages like dplyr, tidyr, readr, ggplot2, tibble and purr, or would like to learn more about how these work together, this class is for you.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: You should be comfortable working with R and RStudio. You should also be familiar with basic data analysis.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Aaron Kessler of CNN; Olga Pierce of University of Nebraska - Lincoln; Andrew Tran of The Washington Post",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "Sapphire Cove - conference level",
        "event_id": "3433/4092",
        "event_url": "https://ire.org/events-and-training/event/3433/4092/"
    },
    {
        "title": "First graphics app: Node.js in the newsroom **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nDana Amihere, Armand Emamdjomeh and Ben Welsh teach you how America’s top news organizations escape rigid content-management systems to publish custom graphics on deadline.\n\nTake this six-hour class and to get hands-on experience in every stage of the development process, writing JavaScript, HTML and CSS within a Node.js framework. You’ll start with data from a real-life Los Angeles Times analysis. You won’t stop until you’ve crafted a custom presentation and deployed a working application on the World Wide Web.\n\nPreregistration is required and seating is limited. Laptops will be provided.\n\nPrerequisites: If you have a good attitude and know how to take a few code crashes in stride, you are qualified for this class. If you’re a little scared, that’s a good thing. You’re ready for this.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Dana Amihere of KPCC - 89.3; Armand Emamdjomeh of The Washington Post; Ben Welsh of Los Angeles Times",
        "date": "2019-03-09",
        "time_start": "09:00",
        "time_end": "17:45",
        "length_in_hours": 8.75,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4111",
        "event_url": "https://ire.org/events-and-training/event/3433/4111/"
    },
    {
        "title": "A conversation with James B. Steele: Insights and lessons for data journalists",
        "type": "Panel",
        "description": "This special session features the wit and wisdom of James B. Steele, one of the nation's most accomplished investigative journalists and a data journalism pioneer.\n\nIn 1972, Steele and reporting partner Donald L. Barlett in collaboration with Philip Meyer used a computer to analyze more than 1,000 cases of violent crime in Philadelphia for The Philadelphia Inquirer -- the largest CAR project of its time. Barlett and Steele worked together for more than 40 years on investigative stories that won two Pulitzer Prizes, two National Magazine Awards, six IRE Awards and a slew of other honors. Over the years, Steele also has produced investigative pieces for Time Inc., Vanity Fair, the Investigative Reporting Workshop and REVEAL from the Center for Investigative Reporting.\n\nBring your own questions and participate in this special conversation, which will be moderated by Sarah Cohen, the Knight Chair in Journalism at the Walter Cronkite School of Journalism at Arizona State University. Cohen previously ran the data reporting team at The New York Times and worked as database editor at The Washington Post, where she shared in the Pulitzer Prize for Investigative Reporting, the IRE medal and other national awards.",
        "speakers": "Sarah Cohen of ASU Walter Cronkite School of Journalism; James B. Steele of independent journalist",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4198",
        "event_url": "https://ire.org/events-and-training/event/3433/4198/"
    },
    {
        "title": "America's dirtiest jobs? Meet America's dirtiest data",
        "type": "Demo",
        "description": "Journalists who have successfully cleaned up some exceptionally dirty data explain how they pulled it off.",
        "speakers": "John Schoen of CNBC Digital",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4299",
        "event_url": "https://ire.org/events-and-training/event/3433/4299/"
    },
    {
        "title": "Being scrappy: Doing data journalism as a team of one",
        "type": "Commons",
        "description": "In many small to medium-sized newsrooms, you could find yourself the only person doing data or interactive journalism. In this NICAR Commons session, we will share tips, tricks and strategies that will help get your data stories published as a team of one. We will also discuss suitable project types that a one-person or scrappy small team is much more efficient at getting done.",
        "speakers": "Taeler De Haes of WEWS-Cleveland; Moiz Syed of The Intercept",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4341",
        "event_url": "https://ire.org/events-and-training/event/3433/4341/"
    },
    {
        "title": "Full-stack React",
        "type": "Hands-on",
        "description": "In this session, we'll walk through how to connect a database-driven backend to a modern, React-driven static website frontend. We'll use Django as our backend of choice for this class, but the principles will apply to any news developer building databases and wanting to connect them to a modern frontend infrastructure. You'll come away knowing how to build the best of both worlds: a backend robust enough to handle huge datasets, and a frontend performant enough to handle your wildest traffic dreams.\n\nThis session is good for: People who are comfortable writing JavaScript and have experience in a backend language.",
        "speakers": "Tyler Fisher of Temple University",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4214",
        "event_url": "https://ire.org/events-and-training/event/3433/4214/"
    },
    {
        "title": "Hitchhiker's guide to APIs",
        "type": "Hands-on",
        "description": "In this hands-on session, you will use Postman to interrogate a web API. We'll guide you through the process of constructing a magic URL that will tell you how Chicago’s violent crime in 2018 compares to other years.\n\nThis session is good for: Beginners. If you’ve ever thought about what goes on in the location bar of your browser, have an eye for patterns, or want better ways to answer your reporting questions, you’ll have a blast.",
        "speakers": "Roberto Rocha of CBC",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4262",
        "event_url": "https://ire.org/events-and-training/event/3433/4262/"
    },
    {
        "title": "Holding algorithms accountable",
        "type": "Panel",
        "description": "Algorithms are increasingly used throughout the public and private sectors, making decisions that impact people’s lives in myriad ways. Algorithmic accountability reporting is an emerging set of methods for investigating how algorithms exert influence and power in society. In this session, we’ll detail concrete investigations in this domain and discuss strategies, methods and techniques for pursuing algorithmic accountability reporting.",
        "speakers": "Nicholas Diakopoulos of Northwestern University",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4185",
        "event_url": "https://ire.org/events-and-training/event/3433/4185/"
    },
    {
        "title": "Introduction to VisiData",
        "type": "Hands-on",
        "description": "VisiData is a relatively new tool for quickly exploring datasets. It's fast, powerful and keyboard-driven. It's often the first piece of software I use to examine new data. In this hands-on session, you'll learn VisiData's essentials commands — including how to sort, filter, summarize and aggregate.\n\nThis session is good for: People who have a basic familiarity with your computer's command line interface. No programming knowledge necessary, but some knowledge of Python is a plus.",
        "speakers": "Jeremy Singer-Vine of BuzzFeed News",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4209",
        "event_url": "https://ire.org/events-and-training/event/3433/4209/"
    },
    {
        "title": "Introduction to digital security",
        "type": "Demo",
        "description": "This demo aims to teach journalists of any knowledge base how to identify their unique threat model and develop a security protocol — regarding secure communication, data storage, and browsing — accordingly. From addressing low-hanging fruit to mitigating sophisticated threats, the tools discussed in this session will introduce journalists to essential concepts in digital security and privacy.",
        "speakers": "Harlo Holmes of Freedom of the Press Foundation",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4306",
        "event_url": "https://ire.org/events-and-training/event/3433/4306/"
    },
    {
        "title": "QGIS 2: Filtering and analyzing geographic data to make maps",
        "type": "Hands-on",
        "description": "Build on your existing knowledge of QGIS and learn how to filter and analyze geographic datasets, before familiarising yourself with exporting the maps you have created using the print composer. We will cover techniques like merging and dissolving polygons, using Open Street Map data in QGIS as well as aggregating point data for easier analysis.\n\nThis session is good for: those who attended the QGIS I workshop or already know the basics of visualizing geographic data in QGIS.",
        "speakers": "Will Dahlgreen of BBC News; Nassos Stylianou of BBC News",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4222",
        "event_url": "https://ire.org/events-and-training/event/3433/4222/"
    },
    {
        "title": "SQL 2: Grouping and summing data (repeat)",
        "type": "Hands-on",
        "description": "If you know how to write a basic SELECT statement in SQL but are looking to make calculations, then this is the session for you. Learn to count how many times certain records appear in a database, and sum totals across records. These skills can come in handy whether you're covering campaign finance or boating licenses. We'll use SQLite and DB Browser, a free database manager.\n\nThis session is good for: People who took “SQL 1: Exploring data” or are familiar with “SELECT” and “WHERE” statements in SQL.",
        "speakers": "Dave Sheingold of independent journalist",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4293",
        "event_url": "https://ire.org/events-and-training/event/3433/4293/"
    },
    {
        "title": "Three open-source workflow tools that your newsroom could use today",
        "type": "Demo",
        "description": "In this session, you will learn about three recently released open-source workflow tools and how they could be immediately useful to your newsroom:\n\n- gspan.js, a JavaScript library for transcribing and annotating CSPAN captions\n\n- Vizier, a GUI for ai2HTML projects. This app makes it easy to use the New York Times' ai2HTML plugin for turning Adobe Illustrator projects into responsive web graphics\n\n- socrata2sql, a Python library for quickly slurping data out of a Socrata portal into your database of choice",
        "speakers": "Andrew Briz of POLITICO; Kavya Sukumar of Hearken; Allan James Vestal of The Dallas Morning News",
        "date": "2019-03-09",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4152",
        "event_url": "https://ire.org/events-and-training/event/3433/4152/"
    },
    {
        "title": "Easy machine learning for data journalists",
        "type": "Demo",
        "description": "In newsrooms, machine learning has been used to identify secret spy planes, tag unreported hate crimes, track overfishing, and more. Google’s machine learning tools make it easy to build projects like this, no data science background required. This one hour talk will give an overview of these tools and show how they can be used for compelling, data-driven reporting.",
        "speakers": "Dale Markowitz of Google",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4361",
        "event_url": "https://ire.org/events-and-training/event/3433/4361/"
    },
    {
        "title": "How to turn data into human stories",
        "type": "Panel",
        "description": "Some reporters are afraid of losing people’s interest by using too many numbers in stories. But data can lead to great narratives, in addition to charts and findings. Our panel will show you how to turn data into compelling human stories that help drive a narrative, create tension and make people care. We will show you how even the most complicated data can be explored in ways that engage and surprise.",
        "speakers": "Aaron Mendelson of KPCC Southern California Public Radio; Sarah Ryley of The Trace; Brandon Stahl of Star Tribune",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4180",
        "event_url": "https://ire.org/events-and-training/event/3433/4180/"
    },
    {
        "title": "Inside the sausage factory: An inside look at government data making",
        "type": "Panel",
        "description": "You've heard of GDPR, but are you aware of how recent legislation by Congress and California may affect your beat? Back by popular demand, this session will bring together two experts in government data management to discuss the impacts of recent 2018 legislation, including: the Foundations for Evidence-based Policymaking Act, the Geospatial Data Act, and the California Consumer Privacy Law. They will discuss how this legislation affects access to data, tracking down data, formats of data, and other nuances of the governmental data making process. They may also speculate wildly on how future legislation could impact government data management.\n\nTipsheet link",
        "speakers": "Rebecca Williams of White House OMB OFCIO; Hunter Owens of Policy Club",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4401",
        "event_url": "https://ire.org/events-and-training/event/3433/4401/"
    },
    {
        "title": "Keeping your career lit while raising humans",
        "type": "Commons",
        "description": "Come to this NICAR Commons session to discuss and share tips on how to keep your career on course after parental leave, childcare struggles and juggling the work-family balance.",
        "speakers": "Megan Luther of InvestigateTV",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4347",
        "event_url": "https://ire.org/events-and-training/event/3433/4347/"
    },
    {
        "title": "No code required: Create compelling interactive data visualizations with Microsoft Power BI",
        "type": "Hands-on",
        "description": "Join Microsoft's Modern Journalism Team for a hands-on workshop where you'll learn to use Microsoft’s free Power BI software and cloud service (Excel’s data visualization cousin) to quickly create and publish engaging interactives that uncover the story hidden in the data. The session will also show how to style your interactive for your publication or station.\n\nYou’ll learn to:\n\n…all through powerful, menu-driven software that readily connects to numerous data sources.\n\nThis session is good for: Anyone, including data beginners.",
        "speakers": "Cathleen Crowley of The Times Union; Vera Chan of Microsoft; Lukasz Pawlowski of Microsoft",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4355",
        "event_url": "https://ire.org/events-and-training/event/3433/4355/"
    },
    {
        "title": "Observable notebooks: Your interactive data journal",
        "type": "Demo",
        "description": "In this gentle introduction, we'll show you how to analyze and visualize data in an Observable notebook, whip up a series of rough prototypes, and export the bones to finish as a news graphic. There's nothing to install, no way to get yourself into a bad state with reactive cells, and no problem loading almost any JavaScript library you can think of. We’ll finish by walking through a series of published Washington Post pieces that started their life as Observable notebooks.",
        "speakers": "Jeremy Ashkenas of Observable; Aaron Williams of The Washington Post",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4308",
        "event_url": "https://ire.org/events-and-training/event/3433/4308/"
    },
    {
        "title": "SQL CARwash: Cleaning dirty data",
        "type": "Hands-on",
        "description": "Spend enough time around databases and inevitably you’ll come across one that has an obnoxious number of variations on city names: New York City. New York. NYC. NY. And yes, even NY City. If you’re not sure how to handle that, this session is for you. We’ll cover how to deal with multiple spellings and misspellings, strange date formats and category codes, as well as a few other tricks and tips for using SQL to clean data.\n\nThis session will be most useful if: You are familiar with basic SQL statements.",
        "speakers": "Madi Alexander of Bloomberg Government",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 4",
        "event_id": "3433/4270",
        "event_url": "https://ire.org/events-and-training/event/3433/4270/"
    },
    {
        "title": "Spatial queries in PostGIS",
        "type": "Hands-on",
        "description": "In this session, you will learn how to write spatial queries in PostGIS in order to make powerful conclusions with your geodata. We’ll go over examples and tricks, while also covering importing and exporting data.\n\nThis class is good for: those comfortable writing their own SQL queries, including how to write “WHERE” and “GROUP BY” statements. Familiarity with writing spatial queries isn’t required, but students should have some basic GIS understanding.",
        "speakers": "Andrew Chavez of The Dallas Morning News; Ariana Giorgi of The Dallas Morning News",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4211",
        "event_url": "https://ire.org/events-and-training/event/3433/4211/"
    },
    {
        "title": "The data-driven escape room",
        "type": "Hands-on",
        "description": "You're an investigative reporter in London, and you have one hour to help your colleague finish a story he's been digging into involving organized crime. We'll provide some real-life data files and some background reading, and you'll work in teams to scour the data, answer questions and do some internet sleuthing to put together the story, all in under an hour.\n\nThis session is good for: Anyone familiar with spreadsheets.",
        "speakers": "Jennifer LaFleur of Investigative Reporting Workshop; Aron Pilhofer of Temple University; Jonathan Stoneman of independent journalist",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4146",
        "event_url": "https://ire.org/events-and-training/event/3433/4146/"
    },
    {
        "title": "The debt trap",
        "type": "Panel",
        "description": "College students are taking on more and more debt to pay for their education. We'll walk you through a federal dataset called College Scorecard so you can make sense of the numbers and get story ideas. We'll also brainstorm ways to tell this $1.5 trillion story by focusing on students and others who are affected the most.\n\nThis session was sponsored by the Lumina Foundation. IRE retains control of content, including the topic and speaker selection, for all conference sessions.",
        "speakers": "Holly Hacker of The Dallas Morning News; Katie Nichols of University of Arkansas; Annie Waldman of ProPublica",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4366",
        "event_url": "https://ire.org/events-and-training/event/3433/4366/"
    },
    {
        "title": "csvkit",
        "type": "Hands-on",
        "description": "Ever struggled with large data sets? Or need to quickly join or merge datasets without the benefit of a database? We will show you how to harness the awesome power of csvkit to wrangle large datasets on the command line. It's easy to use, fast and powerful. It's a must in every data journalist's toolbox.\n\nThis session is good for: People who want a solution for working with multiple CSV files without having to open Excel or to join or merge files without a database.",
        "speakers": "Leila Haddou of The Times & The Sunday Times",
        "date": "2019-03-09",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4233",
        "event_url": "https://ire.org/events-and-training/event/3433/4233/"
    },
    {
        "title": "50 databases to request right now",
        "type": "Panel",
        "description": "Get your FOI templates ready to roll. In this quick-paced, lightning-round style session, two investigative reporters and public records geeks will cover their favorite, most unique, overlooked and under-appreciated records to request from all levels of government. They'll also give examples of how these records were used to produce stories in newsrooms around the country.",
        "speakers": "Mark Walker of The New York Times; Kate Martin of Carolina Public Press",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4189",
        "event_url": "https://ire.org/events-and-training/event/3433/4189/"
    },
    {
        "title": "College sports finances: Where the money comes from and where the money goes",
        "type": "Demo",
        "description": "The playing field is about to change in college athletics. Lawsuits and other challenges are expected to fundamentally change the way college sports -- and especially football -- are financed and played. But how to cover the ongoing story? Who will end up as winners and who will lose out? This interactive session will provide attendees a hands-on opportunity (bring your laptop!) to use the Knight Commission’s NCAA Division I Athletic and Academic Spending Database to understand the financial landscape for Division I college sports, and the differences between well-resourced athletics programs and the ones that depend on school resources. Specific tools for reporters to compare financial statements and trends over time will be revealed for the first time at the 2019 CAR conference. These resources can help lead to enlightening and impactful stories about schools' athletics programs in your region.",
        "speakers": "Scott Hirko of Knight Commission on Intercollegiate Athletics; Jodi Upton of Syracuse University",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4352",
        "event_url": "https://ire.org/events-and-training/event/3433/4352/"
    },
    {
        "title": "Excel 1: Getting started with spreadsheets (repeat)",
        "type": "Hands-on",
        "description": "In this introduction to spreadsheets, you'll begin analyzing data with Excel, a simple but powerful tool. You'll learn how to enter data, sort it, filter it and conduct simple calculations like sum, average and median.\n\nThis session is good for: Data beginners.",
        "speakers": "Janelle O'Dea of St. Louis Post-Dispatch",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4275",
        "event_url": "https://ire.org/events-and-training/event/3433/4275/"
    },
    {
        "title": "Finding needles in haystacks with fuzzy matching",
        "type": "Hands-on",
        "description": "Fuzzy matching is a process for linking up names that are similar but not quite the same. It has become an increasingly important part of data-led investigations as a way to identify connections between public figures, key people and companies that are relevant to a story. This class will cover how fuzzy matching typically fits into the investigative process, with some story examples. Max Harlow, who developed the CSV Match command line tool, will show you how to run some of the different types of fuzzy matching on some real datasets, including the pros and cons of each.\n\nThis session is good for anyone looking for a better way to identify individuals or companies of interest within dirty data.",
        "speakers": "Max Harlow of Financial Times",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4205",
        "event_url": "https://ire.org/events-and-training/event/3433/4205/"
    },
    {
        "title": "How data can inform one of the hottest topics across the country: Housing",
        "type": "Panel",
        "description": "How do local housing markets adapt when decimated by natural or man-made disasters? What’s the affordable housing strategy when Google comes to town? Want to unearth property tax inequities or fraud? This panel of experts will show you how to tackle the trends and complexities of the housing market, and how to make the most of ArcGIS, get help from Zillow Research and navigate property tax data.",
        "speakers": "Matt Clark of Newsday; Lorie Hearn of inewsource; Jon Schleuss of Los Angeles Times; Aaron Terrazas of Zillow",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4158",
        "event_url": "https://ire.org/events-and-training/event/3433/4158/"
    },
    {
        "title": "How it works: Blockchain",
        "type": "Panel",
        "description": "Learn what the blockchain is, the basic principles of a transaction and how money moves between wallets. We'll also suggest ways to analyze transactions for financial investigations and list some obvious obstacles.",
        "speakers": "Shane Shifflett of The Wall Street Journal",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4140",
        "event_url": "https://ire.org/events-and-training/event/3433/4140/"
    },
    {
        "title": "One map, no code: The power of Mapbox Studio",
        "type": "Hands-on",
        "description": "Think you need code to make a highly customized data-driven map? We’re here to show you that you don’t. In this session, we’re going to make a choropleth map and show you how to fine-tune the smallest details with Mapbox Studio.\n\n**You must bring a laptop to participate in this class. You will also need Mapbox and GitHub accounts.\n\nThis session is good for: All skill levels. No JavaScript knowledge required, but basic computer literacy is necessary.",
        "speakers": "Lo Benichou of Mapbox",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4348",
        "event_url": "https://ire.org/events-and-training/event/3433/4348/"
    },
    {
        "title": "R 1: Intro to R and RStudio (repeat)",
        "type": "Hands-on",
        "description": "Learn your way around the basics of RStudio. We’ll load basic packages to do data analysis, read in some data and explore it. This is a good class to learn the basic structure of writing R code. You’ll leave knowing how to get data into R, how to do some cleaning and formatting tasks and how to start doing basic analysis on a dataset. This will give you more confidence to take the next steps in your analyses.\n\nThis session is good for: beginner to intermediate users.",
        "speakers": "Sarah Ryley of The Trace",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4288",
        "event_url": "https://ire.org/events-and-training/event/3433/4288/"
    },
    {
        "title": "Rewriting the code of ethics: New standards for digital journalism",
        "type": "Commons",
        "description": "Surveillance, data breaches and misinformation: The hazards inherent in our digital landscape mandate an update to the journalist's code of ethics. Come prepared with any cases of ethical dilemmas you or your newsroom have encountered online. In this NICAR Commons session, journalists and technologists will discuss examples and work toward a new standard for online behavior.",
        "speakers": "Gisela Perez de Acha of University of California - Berkeley; Mahmoud Hamsho of University of California - Berkeley; Christi Warren of UC Berkeley Graduate School of Journalism; Steve Trush of University of California - Berkeley",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4386",
        "event_url": "https://ire.org/events-and-training/event/3433/4386/"
    },
    {
        "title": "Under pressure: Real life in real time with breaking news",
        "type": "Demo",
        "description": "It’s become one of the hottest sessions at every CAR Conference. How would you and your newsroom fare in digging out little-known facts and information under the pressure of a breaking news deadline? One of the best ways to get better is to practice.\n\nThis is a real-life scenario where you can learn to break news without leaving your computer. The skills learned in this session can also be used for turning daily general assignment stories when there’s not breaking news. This session regularly fills up and the tipsheet that comes with it is in high demand.",
        "speakers": "Stephen Stock of NBC Bay Area",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "15:15",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4304",
        "event_url": "https://ire.org/events-and-training/event/3433/4304/"
    },
    {
        "title": "Digging into data for stories (cont'd-Saturday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "This is a continuation of Digging into data for stories: A crash course from Friday, March 8 for pre-registered attendees of this class.",
        "speakers": null,
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 4",
        "event_id": "3433/4095",
        "event_url": "https://ire.org/events-and-training/event/3433/4095/"
    },
    {
        "title": "Interactive data viz with D3 **pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Intermediate\n\nBring your data to life with elegant and intelligent visualizations with the D3 JavaScript library. We'll start with some JavaScript basics and learn what makes the D3 library so powerful, then use real-world datasets to build your first D3 chart. We will build on D3.js basics by exploring more complex chart forms, covering functions for fetching and manipulating data, and introducing transitions and interaction. We will write working code together and break down how some of our favorite examples of D3 charts work.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: You should have some knowledge of HTML/CSS and programming concepts. Previous JavaScript or D3 experience is not required.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Chris Essig of The Texas Tribune; Ryan Menezes of Los Angeles Times; Priya Krishnakumar of Los Angeles Times",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 5",
        "event_id": "3433/4112",
        "event_url": "https://ire.org/events-and-training/event/3433/4112/"
    },
    {
        "title": "Master class: Writing the data-driven narrative **pre-registered attendees only",
        "type": "Workshop",
        "description": "You’ve gathered and analyzed data, talked to human sources and now you’re ready to write. If you’re new to data-driven storytelling, this workshop is for you.\n\nSarah Cohen is the Knight Chair in Journalism at ASU’s Walter Cronkite School of Journalism and a former editor at The New York Times and The Washington Post. T. Christian Miller is a reporter at ProPublica, where his coverage of sexual assault was recognized with a 2016 Pulitzer Prize. Together they’ll share tips and techniques for writing data-driven stories that pack an emotional punch.\n\nTopics include:\n\nWe’ll look at examples of successful stories, pulling back the curtain to see how they came together.\n\nPreregistration is required and seating is limited.",
        "speakers": "Sarah Cohen of ASU Walter Cronkite School of Journalism; T. Christian Miller of ProPublica",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Crystal Cove - conference level",
        "event_id": "3433/4133",
        "event_url": "https://ire.org/events-and-training/event/3433/4133/"
    },
    {
        "title": "Web scraping with Python (Saturday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Beginner/intermediate\n\nIf you need data that's trapped on a website, writing some code to scrape the page could be your solution. This entry-level class will show you how to use the Python programming language to harvest information from websites into a data file. We'll introduce you to the command line and show you how to write enough code to fetch, parse and analyze web content.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: This class is programming for beginners. Some basic familiarity with HTML and Python is helpful but not required.\n\nNOTE: Registration is required for this session.\n                                    Click here to sign up.",
        "speakers": "Cody Winchester of IRE and NICAR",
        "date": "2019-03-09",
        "time_start": "14:15",
        "time_end": "17:45",
        "length_in_hours": 3.5,
        "room": "Salon 3",
        "event_id": "3433/4395",
        "event_url": "https://ire.org/events-and-training/event/3433/4395/"
    },
    {
        "title": "(Generally) painless collaboration with the greater newsroom",
        "type": "Panel",
        "description": "Traditional reporters and editors often view the data team as a one-stop service desk, a group of unapproachable nerds who will shoot down all their ideas, or full-stack programmers who can magically visualize all the data bouncing around in their heads. In this panel, we’ll discuss ways to revamp your newsroom reputation, change perceptions of your team and open up the lines of communication with your colleagues.",
        "speakers": "Ariana Giorgi of The Dallas Morning News; Ryann Grochowski Jones of ProPublica; Yan Wu of NJ Advance Media",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4178",
        "event_url": "https://ire.org/events-and-training/event/3433/4178/"
    },
    {
        "title": "Behind the story: Case Cleared",
        "type": "Panel",
        "description": "This panel takes a rare deep dive behind the scenes of \"Case Cleared,” a year-long joint investigation from Newsy, Reveal from the Center for Investigative Reporting and ProPublica. Their work uncovered how dozens of police agencies in America are inflating clearance rates for rape by making many rape cases look as if they are solved when they are simply closed with no arrest.\n\nThe team will share reporting methods you can apply to discover key sources that will bring data-heavy stories to life, transforming them into stories that drive impact, and talk about the special challenges of doing that on subjects as sensitive as rape. The team will also describe its continuing collection of rape prosecution data and how you can be a part of that ongoing work and access our data to check on your local police.",
        "speakers": "Sophie Chou of ProPublica; Emily Harris of Reveal from The Center for Investigative Reporting; Mark Fahey of Scripps Washington Bureau; Mark Greenblatt of Scripps Washington Bureau; Nadia Hamdan of KUT Radio/University of Texas",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4370",
        "event_url": "https://ire.org/events-and-training/event/3433/4370/"
    },
    {
        "title": "Cyberwar: Investigating hacking by advanced actors",
        "type": "Panel",
        "description": "How to investigate warfare’s newest front: the cyber realm. We'll walk you through getting more information about this secretive world, including tracking down information about who owns what on the internet, disentangling server logs, studying IP addresses and analyzing malware and emails and more in this session. We’ll also talk about some of the tactics advanced hackers have used in the past to penetrate sensitive networks--and how those efforts can provide clues in future attacks.",
        "speakers": "Rob Barry of The Wall Street Journal; Surya Mattu of The Markup",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4398",
        "event_url": "https://ire.org/events-and-training/event/3433/4398/"
    },
    {
        "title": "Excel 2: Formulas & sorting (repeat)",
        "type": "Hands-on",
        "description": "Much of Excel's power comes in the form of formulas. In this class, you'll learn how to use them to analyze data with the eye of a journalist. Yes, math will be involved, but it's totally worth it! This class will show you how calculations like change, percent change, rates and ratios can beef up your reporting.\n\nThis session is good for: Anyone who is comfortable navigating Excel.",
        "speakers": "Sinduja Rangarajan of Reveal from The Center for Investigative Reporting",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4276",
        "event_url": "https://ire.org/events-and-training/event/3433/4276/"
    },
    {
        "title": "Introducing Slidetrack: Visual annotation for your podcast",
        "type": "Hands-on",
        "description": "Did you know that a third of podcast listening is done on a desktop or laptop computer? Wouldn't it be great to give those listeners access to your visualizations, searchable databases and DocumentCloud embeds? Now you can. SlideTrack is a new, open source project that allows you to annotate audio with documents, photos, graphics, text and embeds. Plus, it's so simple that even an editor can do it.",
        "speakers": "Daniel Lathrop of University of Iowa",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4399",
        "event_url": "https://ire.org/events-and-training/event/3433/4399/"
    },
    {
        "title": "Learn from my fail: Data always sucks edition",
        "type": "Commons",
        "description": "Gather round, friends, and we'll tell some personal stories of otherwise good reporting that failed because we lost sight of a cardinal truth: Data always sucks.",
        "speakers": "Kristin Hussey of independent journalist; Matt Wynn of USA TODAY Network",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4343",
        "event_url": "https://ire.org/events-and-training/event/3433/4343/"
    },
    {
        "title": "Python: Data visualization with Altair",
        "type": "Hands-on",
        "description": "Move over, matplotlib -- a Python library called Altair is promising to make it even easier to create charts and maps for exploratory data analysis. Come learn how to use this library to bring your analysis to life with charts and maps.\n\nThis session is good for: People who already have some familiarity with Python, Jupyter notebooks and using pandas for data analysis.",
        "speakers": "Andrea Suozzo of Seven Days",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4204",
        "event_url": "https://ire.org/events-and-training/event/3433/4204/"
    },
    {
        "title": "R 2: Data analysis and plotting in R (repeat)",
        "type": "Hands-on",
        "description": "We'll use the tidyverse and sf packages, learning how to sort, filter, group, summarize, join, map and visualize to identify trends in your data. If you want to combine SQL-like analysis and charting in a single pipeline, this session is for you.\n\nThis session is good for: People who have worked with data operations in SQL or Excel and would like to do the same in R.",
        "speakers": "Sarah Ryley of The Trace",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4289",
        "event_url": "https://ire.org/events-and-training/event/3433/4289/"
    },
    {
        "title": "Surveys save the day: An old tool emerges as a cutting edge",
        "type": "Panel",
        "description": "Surveys are a familiar social science tool in newsrooms. But did you know that you can use them to break through obstacles in your investigation? In one case, powerful email programs and online surveys let reporters track down thousands of victims whose stolen identities were used to defraud the government. In another case, enterprising reporters barred from part of a foreign country used a mobile phone survey to track down human rights violations. Phil Meyer gave you the basics on newsroom surveys in \"Precision Journalism.\" This panel will explain modern, practical methods and tools that can be adapted for investigative journalism.",
        "speakers": "James Grimaldi of The Wall Street Journal; Chris Jackson of Ipsos; Carolyn Thompson of independent journalist",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4143",
        "event_url": "https://ire.org/events-and-training/event/3433/4143/"
    },
    {
        "title": "Tiplines today: Techniques for secure source communications",
        "type": "Panel",
        "description": "Realizing that sources may need more secure methods of contacting journalists than the plain old telephone, modern media organizations worldwide have begun to look towards consumer-facing mobile apps (Signal, WhatsApp, Telegram, etc.) to create tiplines that can boast communications with increased confidentiality. While this switch is a welcome improvement in maintaining confidential communication with sources, it also comes with a new set of technical, logistical, and legal challenges. This session will address how major news orgs structure their tiplines; grapple with vulnerabilities while maximizing various security features; and craft proactive responses to legal, operational, and technical disasters.",
        "speakers": "Harlo Holmes of Freedom of the Press Foundation; Mike Tigas of ProPublica",
        "date": "2019-03-09",
        "time_start": "15:30",
        "time_end": "16:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4139",
        "event_url": "https://ire.org/events-and-training/event/3433/4139/"
    },
    {
        "title": "Always appeal: Fighting public records battles",
        "type": "Panel",
        "description": "Fighting for public records often involves lengthy and frustrating battles. But don't let that intimidate you -- always go through the appeals process available under state law or the federal Freedom of Information Act. Hear from reporter and \"FOIA terrorist\" Jason Leopold and experienced media attorney Katie Townsend how you can prepare for these battles and see them through to get what you want.",
        "speakers": "Jason Leopold of BuzzFeed News; Katie Townsend of Reporters Committee for Freedom of the Press",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon D",
        "event_id": "3433/4199",
        "event_url": "https://ire.org/events-and-training/event/3433/4199/"
    },
    {
        "title": "Creative ways to teach difficult concepts",
        "type": "Commons",
        "description": "Teaching data journalism in newsrooms and at universities has forced us to come up with creative techniques. We wrote The SQL Song to help one group of boot camp attendees understand the order of commands. In an attempt to help students fine-tune their programs, we did a game show called Query Cash. To make string functions make more sense, we’ve created silly, but useful performances. Bring your fun ideas and we can work out creative solutions together.",
        "speakers": "Jaimi Dowdell of Reuters; Jennifer LaFleur of Investigative Reporting Workshop",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Del Mar",
        "event_id": "3433/4396",
        "event_url": "https://ire.org/events-and-training/event/3433/4396/"
    },
    {
        "title": "Excel 3: Filtering & pivot tables (repeat)",
        "type": "Hands-on",
        "description": "A look at the awesome power of pivot — and how to use it to analyze your dataset in minutes rather than hours. We'll work up to using a pivot table by first sorting and filtering a dataset, learning how to find story ideas along the way.\n\nThis session is good for: Anyone familiar with formulas and navigating Excel or another spreadsheet program.",
        "speakers": "Phillip Reese of The Sacramento Bee",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4274",
        "event_url": "https://ire.org/events-and-training/event/3433/4274/"
    },
    {
        "title": "GitHub for journalists (repeat)",
        "type": "Hands-on",
        "description": "We'll cover Github's basics features  — repositories, commits, branches, pull requests and issues — using a recent data-driven story as a case study. The goal is for you to leave the class and be able to use GitHub on your own for your next story.\n\n**You must bring a laptop to participate in this class. You will also need to create an account at GitHub.com and install GitHub Desktop prior to the class.\n\nThis session is good for: Journalists who want to collaborate on data analyses, back up their work and share their methodology with (nerdy) readers",
        "speakers": "John Templon of BuzzFeed News",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Mariner Cove - conference level",
        "event_id": "3433/4279",
        "event_url": "https://ire.org/events-and-training/event/3433/4279/"
    },
    {
        "title": "Healthcare: Diagnose and treat a data dearth",
        "type": "Panel",
        "description": "Learn to navigate healthcare's data minefield to challenge conventional wisdom, unleash hidden trends and expose industry lies. Our speakers found creative ways around bad or non-existent data to expose a global network of faulty medical devices, track the true danger of giving birth at home and show how private Medicaid contractors systematically deny treatments to boost profits. We'll explore the data and documents you'll need (and those you won't) for your next big investigation.",
        "speakers": "Emily Le Coz of GateHouse Media; J. David McSwane of The Dallas Morning News; Marina Walker Guevara of The International Consortium of Investigative Journalists",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4155",
        "event_url": "https://ire.org/events-and-training/event/3433/4155/"
    },
    {
        "title": "How to collaborate across multiple newsrooms to solve big problems",
        "type": "Panel",
        "description": "There are fewer journalists and fewer outlets, but the problems aren't getting smaller. Learn how to build a successful collaboration that's more than just a single story.",
        "speakers": "Heather Bryant of Project Facet; Matt Dempsey of Houston Chronicle; Deborah Nelson of University of Maryland; Cheryl Phillips of Stanford University",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Cardiff",
        "event_id": "3433/4166",
        "event_url": "https://ire.org/events-and-training/event/3433/4166/"
    },
    {
        "title": "Life after FactFinder",
        "type": "Demo",
        "description": "Love it or hate it, American FactFinder has been the go-to source for Census data since 2010. That will change in the coming months as the Census Bureau switches to its new site, data.census.gov. We’ll take you on a tour and show you some favorite tricks and secrets that we’ve discovered. We’ll also show you how to go deeper into Census data and learn the surprising ways real life affects the way it’s collected.",
        "speakers": "Ronald Campbell of NBC Owned Television Stations; Angeliki Kastanis of The Associated Press; Tyson Weister of U.S. Census Bureau",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon 1&2",
        "event_id": "3433/4136",
        "event_url": "https://ire.org/events-and-training/event/3433/4136/"
    },
    {
        "title": "Python: Writing tests for your code",
        "type": "Hands-on",
        "description": "Every programmer makes mistakes. Writing good tests can help you avoid making them in production. In this session, you will learn how to use Python's built-in tools to automate testing so you can sleep better at night.\n\nThis session is good for: People who use Python regularly and want to improve their workflow.",
        "speakers": "Andrew Chavez of The Dallas Morning News",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4234",
        "event_url": "https://ire.org/events-and-training/event/3433/4234/"
    },
    {
        "title": "R 3: Gathering and cleaning data in R (repeat)",
        "type": "Hands-on",
        "description": "Learn how to use R to collect information from web pages and transform the results into usable data. This session will also teach you how to clean and structure data for analysis using the tidyverse and other packages.\n\nThis session is good for: People who have used R and database software.",
        "speakers": "David Montgomery of CityLab",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Diamond Cove - conference level",
        "event_id": "3433/4290",
        "event_url": "https://ire.org/events-and-training/event/3433/4290/"
    },
    {
        "title": "The next 25 years of CAR",
        "type": "Panel",
        "description": "Rapid advances in technology and a shifting media landscape make it risky to predict the future of data journalism. But our intrepid panelists will venture into forecasting the tools and trends that will shape the next 25 years of data journalism. They'll also tackle emerging ethical and privacy concerns for journalists and the public alike. Come hear what may be in store for you and your newsroom in coming years!",
        "speakers": "Len De Groot of Los Angeles Times; Shazna Nessa of The Wall Street Journal; Latoya Peterson of Data & Society",
        "date": "2019-03-09",
        "time_start": "16:45",
        "time_end": "17:45",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4188",
        "event_url": "https://ire.org/events-and-training/event/3433/4188/"
    },
    {
        "title": "Early career straight-talk: A Q&A on all things jobs and internships",
        "type": "Panel",
        "description": "Do you have questions on how to break into the field, get an internship, or land a job? Simple or impolite ones that you couldn’t ask a boss or hiring manager/editor? Questions about newsroom “culture” or how to network or interview for a job? Get honest advice and input from journalists who once had the same questions you have now. We’re trying to create an informal panel discussion — and encouraging people with hiring power not to attend. Come with your questions, or submit them in advance anonymously: bit.ly/2tl6gY8",
        "speakers": "Alex Duner of Axios; Brett Murphy of USA TODAY Network; Taeler De Haes of WEWS-Cleveland",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4154",
        "event_url": "https://ire.org/events-and-training/event/3433/4154/"
    },
    {
        "title": "Finding needles in haystacks with fuzzy matching (repeat)",
        "type": "Hands-on",
        "description": "Fuzzy matching is a process for linking up names that are similar but not quite the same. It has become an increasingly important part of data-led investigations as a way to identify connections between public figures, key people and companies that are relevant to a story. This class will cover how fuzzy matching typically fits into the investigative process, with some story examples. Max Harlow, who developed the CSV Match command line tool, will show you how to run some of the different types of fuzzy matching on some real datasets, including the pros and cons of each.\n\nThis session is good for anyone looking for a better way to identify individuals or companies of interest within dirty data.",
        "speakers": "Max Harlow of Financial Times",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4278",
        "event_url": "https://ire.org/events-and-training/event/3433/4278/"
    },
    {
        "title": "Install party",
        "type": "Hands-on",
        "description": "Need help installing that cool piece of software you learned about in another session? Bring your laptops and we'll help you get set up.",
        "speakers": "Caitlin Ostroff of McClatchy; Cody Winchester of IRE and NICAR; Matt Wynn of USA TODAY Network",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4309",
        "event_url": "https://ire.org/events-and-training/event/3433/4309/"
    },
    {
        "title": "Python 1: The fundamentals (repeat)",
        "type": "Hands-on",
        "description": "Learning a programming language is much like learning to write a news story. There are certain styles and conventions to follow, a standard order, etc. In this session geared toward absolute beginners, we’ll get started with some of the basics of this new language.\n\nThis session is good for: People who are comfortable working with data in spreadsheets or database managers and want to make the leap to programming.",
        "speakers": "Will Craft of APM Reports",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4284",
        "event_url": "https://ire.org/events-and-training/event/3433/4284/"
    },
    {
        "title": "You just survived NICAR19! Now what?",
        "type": "Panel",
        "description": "You've just spent the past three days absorbing as much information as possible and now it's time to go home and put it all to use. But where do you start? And how do you not immediately lose all that knowledge you just gained? Come to this session to get simple tips and tricks to bring it all home and put it to good use. You'll also learn how IRE can help you ride the NICAR wave long after Newport Beach.",
        "speakers": "Lauren Grandestaff of IRE and NICAR; Erin Mansfield of Tyler Morning Telegraph",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:00",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4402",
        "event_url": "https://ire.org/events-and-training/event/3433/4402/"
    },
    {
        "title": "CAR Conference sales (Sunday)",
        "type": "Special Event",
        "description": "Stop by the CAR Conference sales table and browse our merchandise, including the IRE bookstore's most popular titles and shirts with the winning design from the T-shirt contest.",
        "speakers": null,
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "10:30",
        "length_in_hours": 1.5,
        "room": "Salon EF",
        "event_id": "3433/4385",
        "event_url": "https://ire.org/events-and-training/event/3433/4385/"
    },
    {
        "title": "Digging into data for stories (cont'd-Sunday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "This is a continuation of Digging into data for stories: A crash course from Saturday, March 9 for pre-registered attendees of this class.",
        "speakers": null,
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon 4",
        "event_id": "3433/4096",
        "event_url": "https://ire.org/events-and-training/event/3433/4096/"
    },
    {
        "title": "OpenElections hackathon",
        "type": "Demo",
        "description": "Come join the OpenElections team to help with standardizing 2018 primary and general election results and rebuilding the openelections.net site. No programming skills required, and we’re always interested in finding ways to make it easier for journalists to use our data.",
        "speakers": "Derek Willis of ProPublica",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Salon D",
        "event_id": "3433/4310",
        "event_url": "https://ire.org/events-and-training/event/3433/4310/"
    },
    {
        "title": "Web scraping with Python (Sunday) *pre-registered attendees only",
        "type": "Hands-on",
        "description": "Skill level: Beginner/intermediate\n\nIf you need data that's trapped on a website, writing some code to scrape the page could be your solution. This entry-level class will show you how to use the Python programming language to harvest information from websites into a data file. We'll introduce you to the command line and show you how to write enough code to fetch, parse and analyze web content.\n\nPreregistration is required and seating is limited. Laptops will be provided for the training.\n\nWorkshop prerequisites: This class is programming for beginners. Some basic familiarity with HTML and Python is helpful but not required.",
        "speakers": "Geoff Hing of APM Reports; Andrea Suozzo of Seven Days",
        "date": "2019-03-10",
        "time_start": "09:00",
        "time_end": "12:30",
        "length_in_hours": 3.5,
        "room": "Coral Cove - conference level",
        "event_id": "3433/4093",
        "event_url": "https://ire.org/events-and-training/event/3433/4093/"
    },
    {
        "title": "Adding a text editor to your CAR toolkit",
        "type": "Demo",
        "description": "A good text editor is an essential tool for data journalists, allowing you to inspect and tidy data and seamlessly import into other programs (Excel, a database GUI, your CMS). Stop by this demo session for examples of how a text editor can round out your CAR toolkit.",
        "speakers": "Agustin Armendariz of The New York Times",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4301",
        "event_url": "https://ire.org/events-and-training/event/3433/4301/"
    },
    {
        "title": "JavaScript 1: Fundamentals and syntax (repeat)",
        "type": "Hands-on",
        "description": "Functions, \"for loops\" and objects: They can be confusing at first, but once you master these and other JavaScript coding conventions, you'll be able to build fancy data visualizations and more. In this class, you will learn the basic fundamentals and syntax of the JavaScript programming language. No coding experience is necessary.\n\nThis session is good for: Beginners who want to start building things for the web.",
        "speakers": "Adelaide Chen of Orlando Sentinel",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4280",
        "event_url": "https://ire.org/events-and-training/event/3433/4280/"
    },
    {
        "title": "One-size-doesn't-fit-all: How to make multilingual DDJ work",
        "type": "Panel",
        "description": "Producing a multilingual data journalism project involves more than just translating your story. In this session we'll demonstrate how the BBC, Deutsche Welle and Al Jazeera work with international journalists, developers and designers to develop multilingual data-driven stories that address the needs of local audiences. From carefully planning your project, sourcing hard-to-get data, designing around your audience’s expectations and deploying a sustainable project, this session will cover it all.",
        "speakers": "Gianna-Carina Gruen of Deutsche Welle; Mohammed Haddad of Al Jazeera; Ana Lucia Gonzalez Paz of BBC World Service",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4170",
        "event_url": "https://ire.org/events-and-training/event/3433/4170/"
    },
    {
        "title": "Python 2: Intro to data analysis using pandas (repeat)",
        "type": "Hands-on",
        "description": "Imagine rolling Excel and MySQL into one tool that also allows you to track your code and share it. That’s pandas in a nutshell. There’s a lot more you can do with it, of course, but this will be a good start. We’ll learn how to slice and dice our data and extract basic stats. Specifically, we’ll cover loading the data, filtering, sorting and grouping data.\n\nThis class is good for: People who are comfortable with Excel and are familiar with the basics of SQL and Python.",
        "speakers": "Alexandra Kanik of Louisville Public Media",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4285",
        "event_url": "https://ire.org/events-and-training/event/3433/4285/"
    },
    {
        "title": "Python: Basic mapping and GIS",
        "type": "Hands-on",
        "description": "Learn how to use GeoPandas, a lovely little Python library that will simplify your geospatial life. Manage projections, filter shapefiles, and even create publication-ready maps all from the safe haven of a Jupyter Notebook.\n\nThis session is good for people who use Python in the newsroom. Some familiarity with the Pandas library is ideal, but not required.",
        "speakers": "Scott Pham of BuzzFeed News",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4248",
        "event_url": "https://ire.org/events-and-training/event/3433/4248/"
    },
    {
        "title": "Spreadsheet add-ins you can't live without",
        "type": "Hands-on",
        "description": "Need to geocode? Clean up dirty data? Combine multiple worksheets? Count data by color? Other weird things you need to do to use that one funky spreadsheet that came in through a FOIA? Let's talk about the capabilities of some of the add-ins that are out there for Google Sheets and Excel.",
        "speakers": "Jennifer Peebles of The Atlanta Journal-Constitution",
        "date": "2019-03-10",
        "time_start": "10:15",
        "time_end": "11:15",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4300",
        "event_url": "https://ire.org/events-and-training/event/3433/4300/"
    },
    {
        "title": "Creating your first satellite image",
        "type": "Hands-on",
        "description": "In this hands-on training, we'll learn how to find, download, combine, and turn data captured by satellites into ready-for-publication images. We'll learn three ways to do this, one using entirely point and click tools, another using the command line, and a third using Google Earth Engine.\n\nThis session is good for someone who has never worked with satellite imagery before or wants a refresher.",
        "speakers": "David Yanofsky of Quartz",
        "date": "2019-03-10",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Copper Cove - conference level",
        "event_id": "3433/4271",
        "event_url": "https://ire.org/events-and-training/event/3433/4271/"
    },
    {
        "title": "How to build a collaborative investigation from scratch",
        "type": "Panel",
        "description": "With projects like Documenting Hate and Electionland, ProPublica has developed large collaborations with other newsrooms by using a central database. And now you, too, can launch this type of database-focused project, even without a developer. Find out about free tools ProPublica is creating to make it possible to create a crowd-powered investigation and database, and learn tips and best practices from a new guide on recruiting and working with partners on collaborative investigations.\n\nWe'll talk about ProPublica's approach to crowd-powered, collaborative investigations and soon-to-be-available free tools to allow any newsroom to set up this type of project.",
        "speakers": "Rachel Glickhouse of ProPublica",
        "date": "2019-03-10",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon C",
        "event_id": "3433/4368",
        "event_url": "https://ire.org/events-and-training/event/3433/4368/"
    },
    {
        "title": "JavaScript 2: Hello D3! (repeat)",
        "type": "Hands-on",
        "description": "We’ll cover the basics of getting started with D3, even if you’ve never used it before. Then we’ll take several real datasets and use them to create a few basic charts.\n\nThis session is good for: People with a basic grasp of JavaScript syntax who are interested in building data visualizations for the web.",
        "speakers": "Ellis Simani of Los Angeles Times; Thomas Lauder of Los Angeles Times",
        "date": "2019-03-10",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Emerald Cove - conference level",
        "event_id": "3433/4281",
        "event_url": "https://ire.org/events-and-training/event/3433/4281/"
    },
    {
        "title": "Python 3: Data cleaning and visualization (repeat)",
        "type": "Hands-on",
        "description": "Now that you’ve got a handle on pandas, it’s time to jump into some advanced topics. You know how to import a dataset, but what happens when you load the data and nothing looks right? We’ll walk through cleaning up a dirty dataset with pandas. Then we’ll jump into the fun part: visualizing the data you’ve analyzed with matplotlib.\n\nThis session is good for: People who can load and perform basic summary and grouping functions in pandas.",
        "speakers": "Jacob Quinn Sanders of Factal",
        "date": "2019-03-10",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon 5",
        "event_id": "3433/4286",
        "event_url": "https://ire.org/events-and-training/event/3433/4286/"
    },
    {
        "title": "Year in international CAR",
        "type": "Panel",
        "description": "What were the big stories of the year outside of the US? What were the most creative uses of data analysis? See what your international colleagues have been up to and pick up some story ideas at the same time.",
        "speakers": "John Bones of SKUP Norway; Marianne Bouchart of Data Journalism Awards; Marina Walker Guevara of The International Consortium of Investigative Journalists",
        "date": "2019-03-10",
        "time_start": "11:30",
        "time_end": "12:30",
        "length_in_hours": 1.0,
        "room": "Salon A&B",
        "event_id": "3433/4191",
        "event_url": "https://ire.org/events-and-training/event/3433/4191/"
    }
]